HelloDuoLA/esp32_ble/components/PikaPython/pikascript-api/__pikaBinding.c
/*
 * [Warning!] This file is auto-generated by pika compiler.
 * Do not edit it manually.
 * The source code is *.pyi file.
 * More details: 
 * English Doc:
 * https://pikadoc-en.readthedocs.io/en/latest/PikaScript%20%E6%A8%A1%E5%9D%97%E6%A6%82%E8%BF%B0.html
 * Chinese Doc:
 * http://pikapython.com/doc/PikaScript%20%E6%A8%A1%E5%9D%97%E6%A6%82%E8%BF%B0.html
 */

#include <stdio.h>
#include <stdlib.h>
#include "BaseObj.h"
#include "ESP32.h"
#include "TinyObj.h"

#include "PikaDebug.h"
#include "PikaDebug_Debuger.h"
#include "PikaMain.h"
#include "PikaStdLib_SysObj.h"
#include "PikaStdDevice.h"
#include "PikaStdLib.h"
#include "_bluetooth.h"
#include "_network.h"
#include "_time.h"
#include "PikaStdData.h"
#include "PikaStdData_ByteArray.h"
#include "builtins_bytearray.h"
#include "PikaStdData_Dict.h"
#include "PikaStdData_FILEIO.h"
#include "PikaStdData_List.h"
#include "PikaStdData_Tuple.h"
#include "PikaStdData_String.h"
#include "PikaStdData_Utils.h"
#include "PikaStdData_dict_items.h"
#include "PikaStdData_dict_keys.h"
#include "PikaStdDevice_ADC.h"
#include "PikaStdDevice_BaseDev.h"
#include "PikaStdDevice_CAN.h"
#include "PikaStdDevice_DAC.h"
#include "PikaStdDevice_GPIO.h"
#include "PikaStdDevice_IIC.h"
#include "PikaStdDevice_PWM.h"
#include "PikaStdDevice_SPI.h"
#include "PikaStdDevice_UART.h"
#include "PikaStdLib_MemChecker.h"
#include "PikaStdLib_REPL.h"
#include "PikaStdTask.h"
#include "PikaStdTask_Task.h"
#include "_bluetooth_BLE.h"
#include "_network_WLAN.h"
#include "builtins.h"
#include "builtins_ArithmeticError.h"
#include "builtins_Exception.h"
#include "builtins_AssertionError.h"
#include "builtins_AttributeError.h"
#include "builtins_BaseException.h"
#include "builtins_BlockingIOError.h"
#include "builtins_OSError.h"
#include "builtins_BrokenPipeError.h"
#include "builtins_ConnectionError.h"
#include "builtins_BufferError.h"
#include "builtins_BytesWarning.h"
#include "builtins_Warning.h"
#include "builtins_ChildProcessError.h"
#include "builtins_ConnectionAbortedError.h"
#include "builtins_ConnectionRefusedError.h"
#include "builtins_ConnectionResetError.h"
#include "builtins_DeprecationWarning.h"
#include "builtins_EOFError.h"
#include "builtins_FileExistsError.h"
#include "builtins_FileNotFoundError.h"
#include "builtins_FloatingPointError.h"
#include "builtins_FutureWarning.h"
#include "builtins_GeneratorExit.h"
#include "builtins_ImportError.h"
#include "builtins_ImportWarning.h"
#include "builtins_IndentationError.h"
#include "builtins_SyntaxError.h"
#include "builtins_IndexError.h"
#include "builtins_LookupError.h"
#include "builtins_InterruptedError.h"
#include "builtins_IsADirectoryError.h"
#include "builtins_KeyError.h"
#include "builtins_KeyboardInterrupt.h"
#include "builtins_MemoryError.h"
#include "builtins_ModuleNotFoundError.h"
#include "builtins_NameError.h"
#include "builtins_NotADirectoryError.h"
#include "builtins_NotImplementedError.h"
#include "builtins_RuntimeError.h"
#include "builtins_OverflowError.h"
#include "builtins_PendingDeprecationWarning.h"
#include "builtins_PermissionError.h"
#include "builtins_ProcessLookupError.h"
#include "builtins_RangeObj.h"
#include "builtins_RecursionError.h"
#include "builtins_ReferenceError.h"
#include "builtins_ResourceWarning.h"
#include "builtins_RuntimeWarning.h"
#include "builtins_StopAsyncIteration.h"
#include "builtins_StopIteration.h"
#include "builtins_StringObj.h"
#include "builtins_SyntaxWarning.h"
#include "builtins_SystemError.h"
#include "builtins_SystemExit.h"
#include "builtins_TabError.h"
#include "builtins_TimeoutError.h"
#include "builtins_TypeError.h"
#include "builtins_UnboundLocalError.h"
#include "builtins_UnicodeDecodeError.h"
#include "builtins_UnicodeError.h"
#include "builtins_UnicodeEncodeError.h"
#include "builtins_ValueError.h"
#include "builtins_UnicodeTranslateError.h"
#include "builtins_UnicodeWarning.h"
#include "builtins_UserWarning.h"
#include "builtins_ZeroDivisionError.h"
#include "builtins_object.h"
#include "mytest.h"
#include "mytest_MYTEST.h"
#include "pika_libc.h"

#ifndef PIKA_MODULE_PIKADEBUG_DISABLE
void PikaDebug_DebugerMethod(PikaObj *self, Args *args){
    Arg* res = PikaDebug_Debuger(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaDebug_Debuger,
    "Debuger", ""
);

class_def(PikaDebug){
    __BEFORE_MOETHOD_DEF
    constructor_def(PikaDebug_Debuger, 1761613187),
};
class_inhert(PikaDebug, TinyObj);

PikaObj *New_PikaDebug(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaDebug);
    return self;
}
#endif

#ifndef PIKA_MODULE_PIKADEBUG_DISABLE
void PikaDebug_Debuger___init__Method(PikaObj *self, Args *args){
    PikaDebug_Debuger___init__(self);
}
method_typedef(
    PikaDebug_Debuger___init__,
    "__init__", ""
);

void PikaDebug_Debuger_set_traceMethod(PikaObj *self, Args *args){
    PikaDebug_Debuger_set_trace(self);
}
method_typedef(
    PikaDebug_Debuger_set_trace,
    "set_trace", ""
);

class_def(PikaDebug_Debuger){
    __BEFORE_MOETHOD_DEF
    method_def(PikaDebug_Debuger___init__, 904762485),
    method_def(PikaDebug_Debuger_set_trace, 1131228543),
};
class_inhert(PikaDebug_Debuger, TinyObj);

PikaObj *New_PikaDebug_Debuger(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaDebug_Debuger);
    return self;
}

Arg *PikaDebug_Debuger(PikaObj *self){
    return obj_newObjInPackage(New_PikaDebug_Debuger);
}
#endif

#ifndef PIKA_MODULE_MAIN_DISABLE
class_def(PikaMain){
    __BEFORE_MOETHOD_DEF
};
class_inhert(PikaMain, PikaStdLib_SysObj);

PikaObj *New_PikaMain(Args *args){
    PikaObj *self = New_PikaStdLib_SysObj(args);
    obj_newObj(self, "PikaStdDevice", "PikaStdDevice", New_PikaStdDevice);
    obj_newObj(self, "PikaStdLib", "PikaStdLib", New_PikaStdLib);
    obj_newObj(self, "_bluetooth", "_bluetooth", New__bluetooth);
    obj_newObj(self, "_network", "_network", New__network);
    obj_newObj(self, "_time", "_time", New__time);
    obj_setClass(self, PikaMain);
    return self;
}

Arg *PikaMain(PikaObj *self){
    return obj_newObjInPackage(New_PikaMain);
}
#endif

#ifndef PIKA_MODULE_PIKASTDDATA_DISABLE
void PikaStdData_ByteArrayMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdData_ByteArray(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_ByteArray,
    "ByteArray", ""
);

