HelloDuoLA/esp32_ble/components/PikaPython/pikascript-api/__pikaBinding.c
void PikaStdData_DictMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdData_Dict(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_Dict,
    "Dict", ""
);

void PikaStdData_FILEIOMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdData_FILEIO(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_FILEIO,
    "FILEIO", ""
);

void PikaStdData_ListMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdData_List(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_List,
    "List", ""
);

void PikaStdData_StringMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdData_String(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_String,
    "String", ""
);

void PikaStdData_TupleMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdData_Tuple(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_Tuple,
    "Tuple", ""
);

void PikaStdData_UtilsMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdData_Utils(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_Utils,
    "Utils", ""
);

void PikaStdData_dict_itemsMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdData_dict_items(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_dict_items,
    "dict_items", ""
);

void PikaStdData_dict_keysMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdData_dict_keys(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_dict_keys,
    "dict_keys", ""
);

class_def(PikaStdData){
    __BEFORE_MOETHOD_DEF
    constructor_def(PikaStdData_Tuple, 238099855),
    constructor_def(PikaStdData_Utils, 239242230),
    constructor_def(PikaStdData_FILEIO, 813431197),
    constructor_def(PikaStdData_dict_keys, 872966404),
    constructor_def(PikaStdData_dict_items, 888749258),
    constructor_def(PikaStdData_String, 1374591964),
    constructor_def(PikaStdData_ByteArray, 1998882840),
    constructor_def(PikaStdData_Dict, 2089035049),
    constructor_def(PikaStdData_List, 2089323073),
};
class_inhert(PikaStdData, TinyObj);

PikaObj *New_PikaStdData(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdData);
    return self;
}
#endif

#ifndef PIKA_MODULE_PIKASTDDATA_DISABLE
class_def(PikaStdData_ByteArray){
    __BEFORE_MOETHOD_DEF
};
class_inhert(PikaStdData_ByteArray, builtins_bytearray);

PikaObj *New_PikaStdData_ByteArray(Args *args){
    PikaObj *self = New_builtins_bytearray(args);
    obj_setClass(self, PikaStdData_ByteArray);
    return self;
}

Arg *PikaStdData_ByteArray(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdData_ByteArray);
}
#endif

#ifndef PIKA_MODULE_PIKASTDDATA_DISABLE
void PikaStdData_Dict___contains__Method(PikaObj *self, Args *args){
    Arg* val = args_getArg(args, "val");
    int res = PikaStdData_Dict___contains__(self, val);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdData_Dict___contains__,
    "__contains__", "val"
);

void PikaStdData_Dict___del__Method(PikaObj *self, Args *args){
    PikaStdData_Dict___del__(self);
}
method_typedef(
    PikaStdData_Dict___del__,
    "__del__", ""
);

void PikaStdData_Dict___getitem__Method(PikaObj *self, Args *args){
    Arg* __key = args_getArg(args, "__key");
    Arg* res = PikaStdData_Dict___getitem__(self, __key);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_Dict___getitem__,
    "__getitem__", "__key"
);

void PikaStdData_Dict___init__Method(PikaObj *self, Args *args){
    PikaStdData_Dict___init__(self);
}
method_typedef(
    PikaStdData_Dict___init__,
    "__init__", ""
);

void PikaStdData_Dict___iter__Method(PikaObj *self, Args *args){
    Arg* res = PikaStdData_Dict___iter__(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_Dict___iter__,
    "__iter__", ""
);

void PikaStdData_Dict___len__Method(PikaObj *self, Args *args){
    int res = PikaStdData_Dict___len__(self);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdData_Dict___len__,
    "__len__", ""
);

void PikaStdData_Dict___next__Method(PikaObj *self, Args *args){
    Arg* res = PikaStdData_Dict___next__(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_Dict___next__,
    "__next__", ""
);

void PikaStdData_Dict___setitem__Method(PikaObj *self, Args *args){
    Arg* __key = args_getArg(args, "__key");
    Arg* __val = args_getArg(args, "__val");
    PikaStdData_Dict___setitem__(self, __key, __val);
}
method_typedef(
    PikaStdData_Dict___setitem__,
    "__setitem__", "__key,__val"
);

void PikaStdData_Dict___str__Method(PikaObj *self, Args *args){
    char* res = PikaStdData_Dict___str__(self);
    method_returnStr(args, res);
}
method_typedef(
    PikaStdData_Dict___str__,
    "__str__", ""
);

void PikaStdData_Dict_getMethod(PikaObj *self, Args *args){
    char* key = args_getStr(args, "key");
    Arg* res = PikaStdData_Dict_get(self, key);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_Dict_get,
    "get", "key"
);

void PikaStdData_Dict_itemsMethod(PikaObj *self, Args *args){
    PikaObj* res = PikaStdData_Dict_items(self);
    method_returnObj(args, res);
}
method_typedef(
    PikaStdData_Dict_items,
    "items", ""
);

void PikaStdData_Dict_keysMethod(PikaObj *self, Args *args){
    PikaObj* res = PikaStdData_Dict_keys(self);
    method_returnObj(args, res);
}
method_typedef(
    PikaStdData_Dict_keys,
    "keys", ""
);

void PikaStdData_Dict_removeMethod(PikaObj *self, Args *args){
    char* key = args_getStr(args, "key");
    PikaStdData_Dict_remove(self, key);
}
method_typedef(
    PikaStdData_Dict_remove,
    "remove", "key"
);

void PikaStdData_Dict_setMethod(PikaObj *self, Args *args){
    char* key = args_getStr(args, "key");
    Arg* arg = args_getArg(args, "arg");
    PikaStdData_Dict_set(self, key, arg);
}
method_typedef(
    PikaStdData_Dict_set,
    "set", "key,arg"
);

void PikaStdData_Dict_updateMethod(PikaObj *self, Args *args){
    PikaObj* other = args_getPtr(args, "other");
    PikaStdData_Dict_update(self, other);
}
method_typedef(
    PikaStdData_Dict_update,
    "update", "other"
);

