HelloDuoLA/esp32_ble/components/PikaPython/pikascript-api/__pikaBinding.c
void PikaStdData_dict_keys___next__Method(PikaObj *self, Args *args){
    Arg* res = PikaStdData_dict_keys___next__(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_dict_keys___next__,
    "__next__", ""
);

void PikaStdData_dict_keys___str__Method(PikaObj *self, Args *args){
    char* res = PikaStdData_dict_keys___str__(self);
    method_returnStr(args, res);
}
method_typedef(
    PikaStdData_dict_keys___str__,
    "__str__", ""
);

class_def(PikaStdData_dict_keys){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdData_dict_keys___iter__, 911732085),
    method_def(PikaStdData_dict_keys___next__, 1090305216),
    method_def(PikaStdData_dict_keys___len__, 2047989248),
    method_def(PikaStdData_dict_keys___str__, 2056834106),
};
class_inhert(PikaStdData_dict_keys, TinyObj);

PikaObj *New_PikaStdData_dict_keys(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdData_dict_keys);
    return self;
}

Arg *PikaStdData_dict_keys(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdData_dict_keys);
}
#endif

#ifndef PIKA_MODULE_PIKASTDDEVICE_DISABLE
void PikaStdDevice_ADCMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdDevice_ADC(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdDevice_ADC,
    "ADC", ""
);

void PikaStdDevice_BaseDevMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdDevice_BaseDev(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdDevice_BaseDev,
    "BaseDev", ""
);

void PikaStdDevice_CANMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdDevice_CAN(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdDevice_CAN,
    "CAN", ""
);

void PikaStdDevice_DACMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdDevice_DAC(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdDevice_DAC,
    "DAC", ""
);

void PikaStdDevice_GPIOMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdDevice_GPIO(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdDevice_GPIO,
    "GPIO", ""
);

void PikaStdDevice_IICMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdDevice_IIC(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdDevice_IIC,
    "IIC", ""
);

void PikaStdDevice_PWMMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdDevice_PWM(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdDevice_PWM,
    "PWM", ""
);

void PikaStdDevice_SPIMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdDevice_SPI(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdDevice_SPI,
    "SPI", ""
);

void PikaStdDevice_TimeMethod(PikaObj *self, Args *args){
    PikaObj* res = PikaStdDevice_Time(self);
    method_returnObj(args, res);
}
method_typedef(
    PikaStdDevice_Time,
    "Time", ""
);

void PikaStdDevice_UARTMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdDevice_UART(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdDevice_UART,
    "UART", ""
);

class_def(PikaStdDevice){
    __BEFORE_MOETHOD_DEF
    constructor_def(PikaStdDevice_ADC, 193450093),
    constructor_def(PikaStdDevice_CAN, 193452183),
    constructor_def(PikaStdDevice_DAC, 193453261),
    constructor_def(PikaStdDevice_IIC, 193458970),
    constructor_def(PikaStdDevice_PWM, 193467065),
    constructor_def(PikaStdDevice_SPI, 193470097),
    constructor_def(PikaStdDevice_BaseDev, 1189166879),
    constructor_def(PikaStdDevice_GPIO, 2089114740),
    constructor_def(PikaStdDevice_UART, 2089601825),
    method_def(PikaStdDevice_Time, 2089610356),
};
class_inhert(PikaStdDevice, TinyObj);

PikaObj *New_PikaStdDevice(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdDevice);
    return self;
}
#endif

#ifndef PIKA_MODULE_PIKASTDDEVICE_DISABLE
void PikaStdDevice_ADC___init__Method(PikaObj *self, Args *args){
    PikaStdDevice_ADC___init__(self);
}
method_typedef(
    PikaStdDevice_ADC___init__,
    "__init__", ""
);

void PikaStdDevice_ADC_closeMethod(PikaObj *self, Args *args){
    PikaStdDevice_ADC_close(self);
}
method_typedef(
    PikaStdDevice_ADC_close,
    "close", ""
);

void PikaStdDevice_ADC_disableMethod(PikaObj *self, Args *args){
    PikaStdDevice_ADC_disable(self);
}
method_typedef(
    PikaStdDevice_ADC_disable,
    "disable", ""
);

void PikaStdDevice_ADC_enableMethod(PikaObj *self, Args *args){
    PikaStdDevice_ADC_enable(self);
}
method_typedef(
    PikaStdDevice_ADC_enable,
    "enable", ""
);

void PikaStdDevice_ADC_platformDisableMethod(PikaObj *self, Args *args){
    PikaStdDevice_ADC_platformDisable(self);
}
method_typedef(
    PikaStdDevice_ADC_platformDisable,
    "platformDisable", ""
);

void PikaStdDevice_ADC_platformEnableMethod(PikaObj *self, Args *args){
    PikaStdDevice_ADC_platformEnable(self);
}
method_typedef(
    PikaStdDevice_ADC_platformEnable,
    "platformEnable", ""
);

void PikaStdDevice_ADC_platformReadMethod(PikaObj *self, Args *args){
    PikaStdDevice_ADC_platformRead(self);
}
method_typedef(
    PikaStdDevice_ADC_platformRead,
    "platformRead", ""
);

void PikaStdDevice_ADC_readMethod(PikaObj *self, Args *args){
    pika_float res = PikaStdDevice_ADC_read(self);
    method_returnFloat(args, res);
}
method_typedef(
    PikaStdDevice_ADC_read,
    "read", ""
);

void PikaStdDevice_ADC_setPinMethod(PikaObj *self, Args *args){
    char* pin = args_getStr(args, "pin");
    PikaStdDevice_ADC_setPin(self, pin);
}
method_typedef(
    PikaStdDevice_ADC_setPin,
    "setPin", "pin"
);

class_def(PikaStdDevice_ADC){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdDevice_ADC_close, 255564379),
    method_def(PikaStdDevice_ADC_disable, 314893497),
    method_def(PikaStdDevice_ADC_platformDisable, 326843198),
    method_def(PikaStdDevice_ADC_setPin, 461696568),
    method_def(PikaStdDevice_ADC_platformEnable, 835227025),
    method_def(PikaStdDevice_ADC___init__, 904762485),
    method_def(PikaStdDevice_ADC_platformRead, 1797695974),
    method_def(PikaStdDevice_ADC_enable, 2071294892),
    method_def(PikaStdDevice_ADC_read, 2090683713),
};
class_inhert(PikaStdDevice_ADC, PikaStdDevice_BaseDev);

PikaObj *New_PikaStdDevice_ADC(Args *args){
    PikaObj *self = New_PikaStdDevice_BaseDev(args);
    obj_setClass(self, PikaStdDevice_ADC);
    return self;
}

Arg *PikaStdDevice_ADC(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdDevice_ADC);
}
#endif

