HelloDuoLA/esp32_ble/components/PikaPython/pikascript-api/__pikaBinding.c
#ifndef PIKA_MODULE_PIKASTDDEVICE_DISABLE
void PikaStdDevice_DAC___init__Method(PikaObj *self, Args *args){
    PikaStdDevice_DAC___init__(self);
}
method_typedef(
    PikaStdDevice_DAC___init__,
    "__init__", ""
);

void PikaStdDevice_DAC_closeMethod(PikaObj *self, Args *args){
    PikaStdDevice_DAC_close(self);
}
method_typedef(
    PikaStdDevice_DAC_close,
    "close", ""
);

void PikaStdDevice_DAC_disableMethod(PikaObj *self, Args *args){
    PikaStdDevice_DAC_disable(self);
}
method_typedef(
    PikaStdDevice_DAC_disable,
    "disable", ""
);

void PikaStdDevice_DAC_enableMethod(PikaObj *self, Args *args){
    PikaStdDevice_DAC_enable(self);
}
method_typedef(
    PikaStdDevice_DAC_enable,
    "enable", ""
);

void PikaStdDevice_DAC_setPinMethod(PikaObj *self, Args *args){
    char* pin = args_getStr(args, "pin");
    PikaStdDevice_DAC_setPin(self, pin);
}
method_typedef(
    PikaStdDevice_DAC_setPin,
    "setPin", "pin"
);

void PikaStdDevice_DAC_writeMethod(PikaObj *self, Args *args){
    pika_float val = args_getFloat(args, "val");
    PikaStdDevice_DAC_write(self, val);
}
method_typedef(
    PikaStdDevice_DAC_write,
    "write", "val"
);

class_def(PikaStdDevice_DAC){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdDevice_DAC_close, 255564379),
    method_def(PikaStdDevice_DAC_write, 279491920),
    method_def(PikaStdDevice_DAC_disable, 314893497),
    method_def(PikaStdDevice_DAC_setPin, 461696568),
    method_def(PikaStdDevice_DAC___init__, 904762485),
    method_def(PikaStdDevice_DAC_enable, 2071294892),
};
class_inhert(PikaStdDevice_DAC, PikaStdDevice_BaseDev);

PikaObj *New_PikaStdDevice_DAC(Args *args){
    PikaObj *self = New_PikaStdDevice_BaseDev(args);
    obj_setClass(self, PikaStdDevice_DAC);
    return self;
}

Arg *PikaStdDevice_DAC(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdDevice_DAC);
}
#endif

#ifndef PIKA_MODULE_PIKASTDDEVICE_DISABLE
void PikaStdDevice_GPIO___init__Method(PikaObj *self, Args *args){
    PikaStdDevice_GPIO___init__(self);
}
method_typedef(
    PikaStdDevice_GPIO___init__,
    "__init__", ""
);

void PikaStdDevice_GPIO_closeMethod(PikaObj *self, Args *args){
    PikaStdDevice_GPIO_close(self);
}
method_typedef(
    PikaStdDevice_GPIO_close,
    "close", ""
);

void PikaStdDevice_GPIO_disableMethod(PikaObj *self, Args *args){
    PikaStdDevice_GPIO_disable(self);
}
method_typedef(
    PikaStdDevice_GPIO_disable,
    "disable", ""
);

void PikaStdDevice_GPIO_enableMethod(PikaObj *self, Args *args){
    PikaStdDevice_GPIO_enable(self);
}
method_typedef(
    PikaStdDevice_GPIO_enable,
    "enable", ""
);

void PikaStdDevice_GPIO_getIdMethod(PikaObj *self, Args *args){
    int res = PikaStdDevice_GPIO_getId(self);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdDevice_GPIO_getId,
    "getId", ""
);

void PikaStdDevice_GPIO_getModeMethod(PikaObj *self, Args *args){
    char* res = PikaStdDevice_GPIO_getMode(self);
    method_returnStr(args, res);
}
method_typedef(
    PikaStdDevice_GPIO_getMode,
    "getMode", ""
);

void PikaStdDevice_GPIO_getPinMethod(PikaObj *self, Args *args){
    char* res = PikaStdDevice_GPIO_getPin(self);
    method_returnStr(args, res);
}
method_typedef(
    PikaStdDevice_GPIO_getPin,
    "getPin", ""
);

void PikaStdDevice_GPIO_highMethod(PikaObj *self, Args *args){
    PikaStdDevice_GPIO_high(self);
}
method_typedef(
    PikaStdDevice_GPIO_high,
    "high", ""
);

void PikaStdDevice_GPIO_lowMethod(PikaObj *self, Args *args){
    PikaStdDevice_GPIO_low(self);
}
method_typedef(
    PikaStdDevice_GPIO_low,
    "low", ""
);

void PikaStdDevice_GPIO_platformDisableMethod(PikaObj *self, Args *args){
    PikaStdDevice_GPIO_platformDisable(self);
}
method_typedef(
    PikaStdDevice_GPIO_platformDisable,
    "platformDisable", ""
);

void PikaStdDevice_GPIO_platformEnableMethod(PikaObj *self, Args *args){
    PikaStdDevice_GPIO_platformEnable(self);
}
method_typedef(
    PikaStdDevice_GPIO_platformEnable,
    "platformEnable", ""
);

void PikaStdDevice_GPIO_platformHighMethod(PikaObj *self, Args *args){
    PikaStdDevice_GPIO_platformHigh(self);
}
method_typedef(
    PikaStdDevice_GPIO_platformHigh,
    "platformHigh", ""
);

void PikaStdDevice_GPIO_platformLowMethod(PikaObj *self, Args *args){
    PikaStdDevice_GPIO_platformLow(self);
}
method_typedef(
    PikaStdDevice_GPIO_platformLow,
    "platformLow", ""
);

void PikaStdDevice_GPIO_platformReadMethod(PikaObj *self, Args *args){
    PikaStdDevice_GPIO_platformRead(self);
}
method_typedef(
    PikaStdDevice_GPIO_platformRead,
    "platformRead", ""
);

void PikaStdDevice_GPIO_platformSetModeMethod(PikaObj *self, Args *args){
    PikaStdDevice_GPIO_platformSetMode(self);
}
method_typedef(
    PikaStdDevice_GPIO_platformSetMode,
    "platformSetMode", ""
);

void PikaStdDevice_GPIO_readMethod(PikaObj *self, Args *args){
    int res = PikaStdDevice_GPIO_read(self);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdDevice_GPIO_read,
    "read", ""
);

void PikaStdDevice_GPIO_setCallBackMethod(PikaObj *self, Args *args){
    Arg* eventCallBack = args_getArg(args, "eventCallBack");
    int filter = args_getInt(args, "filter");
    PikaStdDevice_GPIO_setCallBack(self, eventCallBack, filter);
}
method_typedef(
    PikaStdDevice_GPIO_setCallBack,
    "setCallBack", "eventCallBack,filter"
);

void PikaStdDevice_GPIO_setCallbackMethod(PikaObj *self, Args *args){
    Arg* eventCallBack = args_getArg(args, "eventCallBack");
    int filter = args_getInt(args, "filter");
    PikaStdDevice_GPIO_setCallback(self, eventCallBack, filter);
}
method_typedef(
    PikaStdDevice_GPIO_setCallback,
    "setCallback", "eventCallBack,filter"
);

void PikaStdDevice_GPIO_setIdMethod(PikaObj *self, Args *args){
    int id = args_getInt(args, "id");
    PikaStdDevice_GPIO_setId(self, id);
}
method_typedef(
    PikaStdDevice_GPIO_setId,
    "setId", "id"
);

void PikaStdDevice_GPIO_setModeMethod(PikaObj *self, Args *args){
    char* mode = args_getStr(args, "mode");
    PikaStdDevice_GPIO_setMode(self, mode);
}
method_typedef(
    PikaStdDevice_GPIO_setMode,
    "setMode", "mode"
);

void PikaStdDevice_GPIO_setPinMethod(PikaObj *self, Args *args){
    char* pinName = args_getStr(args, "pinName");
    PikaStdDevice_GPIO_setPin(self, pinName);
}
method_typedef(
    PikaStdDevice_GPIO_setPin,
    "setPin", "pinName"
);

void PikaStdDevice_GPIO_setPullMethod(PikaObj *self, Args *args){
    char* pull = args_getStr(args, "pull");
    PikaStdDevice_GPIO_setPull(self, pull);
}
method_typedef(
    PikaStdDevice_GPIO_setPull,
    "setPull", "pull"
);

class_def(PikaStdDevice_GPIO){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdDevice_GPIO_low, 193498391),
    method_def(PikaStdDevice_GPIO_setMode, 203499702),
    method_def(PikaStdDevice_GPIO_setPull, 203614318),
    method_def(PikaStdDevice_GPIO_platformSetMode, 215449403),
    method_def(PikaStdDevice_GPIO_close, 255564379),
    method_def(PikaStdDevice_GPIO_getId, 260060562),
    method_def(PikaStdDevice_GPIO_setId, 274291614),
    method_def(PikaStdDevice_GPIO_disable, 314893497),
    method_def(PikaStdDevice_GPIO_platformDisable, 326843198),
    method_def(PikaStdDevice_GPIO_setPin, 461696568),
    method_def(PikaStdDevice_GPIO_platformEnable, 835227025),
    method_def(PikaStdDevice_GPIO___init__, 904762485),
    method_def(PikaStdDevice_GPIO_setCallBack, 945732542),
    method_def(PikaStdDevice_GPIO_setCallback, 946882526),
    method_def(PikaStdDevice_GPIO_platformLow, 1616275740),
    method_def(PikaStdDevice_GPIO_platformHigh, 1797341162),
    method_def(PikaStdDevice_GPIO_platformRead, 1797695974),
    method_def(PikaStdDevice_GPIO_getMode, 1885753258),
    method_def(PikaStdDevice_GPIO_enable, 2071294892),
    method_def(PikaStdDevice_GPIO_high, 2090328901),
    method_def(PikaStdDevice_GPIO_read, 2090683713),
    method_def(PikaStdDevice_GPIO_getPin, 2139555500),
};
class_inhert(PikaStdDevice_GPIO, PikaStdDevice_BaseDev);

PikaObj *New_PikaStdDevice_GPIO(Args *args){
    PikaObj *self = New_PikaStdDevice_BaseDev(args);
    obj_setClass(self, PikaStdDevice_GPIO);
    return self;
}

