HelloDuoLA/esp32_ble/components/PikaPython/pikascript-api/__pikaBinding.c
void PikaStdLib_MemChecker_nowMethod(PikaObj *self, Args *args){
    PikaStdLib_MemChecker_now(self);
}
method_typedef(
    PikaStdLib_MemChecker_now,
    "now", ""
);

void PikaStdLib_MemChecker_resetMaxMethod(PikaObj *self, Args *args){
    PikaStdLib_MemChecker_resetMax(self);
}
method_typedef(
    PikaStdLib_MemChecker_resetMax,
    "resetMax", ""
);

class_def(PikaStdLib_MemChecker){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdLib_MemChecker_max, 193499019),
    method_def(PikaStdLib_MemChecker_now, 193500569),
#if !PIKA_NANO_ENABLE
    method_def(PikaStdLib_MemChecker_resetMax, 593750542),
#endif
#if !PIKA_NANO_ENABLE
    method_def(PikaStdLib_MemChecker_getMax, 2139551979),
#endif
#if !PIKA_NANO_ENABLE
    method_def(PikaStdLib_MemChecker_getNow, 2139553529),
#endif
};
class_inhert(PikaStdLib_MemChecker, TinyObj);

PikaObj *New_PikaStdLib_MemChecker(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdLib_MemChecker);
    return self;
}

Arg *PikaStdLib_MemChecker(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdLib_MemChecker);
}
#endif

#ifndef PIKA_MODULE_PIKASTDLIB_DISABLE
void PikaStdLib_REPL_setEchoMethod(PikaObj *self, Args *args){
    pika_bool echo = args_getBool(args, "echo");
    PikaStdLib_REPL_setEcho(self, echo);
}
method_typedef(
    PikaStdLib_REPL_setEcho,
    "setEcho", "echo"
);

class_def(PikaStdLib_REPL){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdLib_REPL_setEcho, 203199280),
};
class_inhert(PikaStdLib_REPL, TinyObj);

PikaObj *New_PikaStdLib_REPL(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdLib_REPL);
    return self;
}

Arg *PikaStdLib_REPL(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdLib_REPL);
}
#endif

#ifndef PIKA_MODULE_PIKASTDLIB_DISABLE
class_def(PikaStdLib_SysObj){
    __BEFORE_MOETHOD_DEF
};
class_inhert(PikaStdLib_SysObj, TinyObj);

PikaObj *New_PikaStdLib_SysObj(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdLib_SysObj);
    return self;
}

Arg *PikaStdLib_SysObj(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdLib_SysObj);
}
#endif

#ifndef PIKA_MODULE_PIKASTDTASK_DISABLE
void PikaStdTask_TaskMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdTask_Task(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdTask_Task,
    "Task", ""
);

class_def(PikaStdTask){
    __BEFORE_MOETHOD_DEF
    constructor_def(PikaStdTask_Task, 2089601848),
};
class_inhert(PikaStdTask, TinyObj);

PikaObj *New_PikaStdTask(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdTask);
    return self;
}
#endif

#ifndef PIKA_MODULE_PIKASTDTASK_DISABLE
void PikaStdTask_Task___init__Method(PikaObj *self, Args *args){
    PikaStdTask_Task___init__(self);
}
method_typedef(
    PikaStdTask_Task___init__,
    "__init__", ""
);

void PikaStdTask_Task_call_alwaysMethod(PikaObj *self, Args *args){
    Arg* fun_todo = args_getArg(args, "fun_todo");
    PikaStdTask_Task_call_always(self, fun_todo);
}
method_typedef(
    PikaStdTask_Task_call_always,
    "call_always", "fun_todo"
);

void PikaStdTask_Task_call_period_msMethod(PikaObj *self, Args *args){
    Arg* fun_todo = args_getArg(args, "fun_todo");
    int period_ms = args_getInt(args, "period_ms");
    PikaStdTask_Task_call_period_ms(self, fun_todo, period_ms);
}
method_typedef(
    PikaStdTask_Task_call_period_ms,
    "call_period_ms", "fun_todo,period_ms"
);

void PikaStdTask_Task_call_whenMethod(PikaObj *self, Args *args){
    Arg* fun_todo = args_getArg(args, "fun_todo");
    Arg* fun_when = args_getArg(args, "fun_when");
    PikaStdTask_Task_call_when(self, fun_todo, fun_when);
}
method_typedef(
    PikaStdTask_Task_call_when,
    "call_when", "fun_todo,fun_when"
);

void PikaStdTask_Task_platformGetTickMethod(PikaObj *self, Args *args){
    PikaStdTask_Task_platformGetTick(self);
}
method_typedef(
    PikaStdTask_Task_platformGetTick,
    "platformGetTick", ""
);

void PikaStdTask_Task_run_foreverMethod(PikaObj *self, Args *args){
    PikaStdTask_Task_run_forever(self);
}
method_typedef(
    PikaStdTask_Task_run_forever,
    "run_forever", ""
);

void PikaStdTask_Task_run_onceMethod(PikaObj *self, Args *args){
    PikaStdTask_Task_run_once(self);
}
method_typedef(
    PikaStdTask_Task_run_once,
    "run_once", ""
);

void PikaStdTask_Task_run_until_msMethod(PikaObj *self, Args *args){
    int until_ms = args_getInt(args, "until_ms");
    PikaStdTask_Task_run_until_ms(self, until_ms);
}
method_typedef(
    PikaStdTask_Task_run_until_ms,
    "run_until_ms", "until_ms"
);

class_def(PikaStdTask_Task){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdTask_Task_run_forever, 408322738),
    method_def(PikaStdTask_Task_run_until_ms, 854930212),
    method_def(PikaStdTask_Task___init__, 904762485),
    method_def(PikaStdTask_Task_call_always, 1368427953),
    method_def(PikaStdTask_Task_call_period_ms, 1674236450),
    method_def(PikaStdTask_Task_run_once, 1726949022),
    method_def(PikaStdTask_Task_platformGetTick, 1897947957),
    method_def(PikaStdTask_Task_call_when, 2141638002),
};
class_inhert(PikaStdTask_Task, PikaStdLib_SysObj);

PikaObj *New_PikaStdTask_Task(Args *args){
    PikaObj *self = New_PikaStdLib_SysObj(args);
    obj_newObj(self, "calls", "PikaStdData_List", New_PikaStdData_List);
    obj_setClass(self, PikaStdTask_Task);
    return self;
}

Arg *PikaStdTask_Task(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdTask_Task);
}
#endif

#ifndef PIKA_MODULE__BLUETOOTH_DISABLE
void _bluetooth_BLEMethod(PikaObj *self, Args *args){
    Arg* res = _bluetooth_BLE(self);
    method_returnArg(args, res);
}
method_typedef(
    _bluetooth_BLE,
    "BLE", ""
);

class_def(_bluetooth){
    __BEFORE_MOETHOD_DEF
    constructor_def(_bluetooth_BLE, 193451448),
};
class_inhert(_bluetooth, TinyObj);

PikaObj *New__bluetooth(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, _bluetooth);
    return self;
}
#endif

#ifndef PIKA_MODULE__BLUETOOTH_DISABLE
void _bluetooth_BLE_advertiseMethod(PikaObj *self, Args *args){
    int own_addr_type = args_getInt(args, "own_addr_type");
    int interval_us = args_getInt(args, "interval_us");
    pika_bool connectable = args_getBool(args, "connectable");
    int res = _bluetooth_BLE_advertise(self, own_addr_type, interval_us, connectable);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_advertise,
    "advertise", "own_addr_type,interval_us,connectable"
);

void _bluetooth_BLE_config_addr_mode_getMethod(PikaObj *self, Args *args){
    int res = _bluetooth_BLE_config_addr_mode_get(self);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_config_addr_mode_get,
    "config_addr_mode_get", ""
);

void _bluetooth_BLE_config_addr_mode_updateMethod(PikaObj *self, Args *args){
    int res = _bluetooth_BLE_config_addr_mode_update(self);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_config_addr_mode_update,
    "config_addr_mode_update", ""
);

void _bluetooth_BLE_config_addr_rxbuf_getMethod(PikaObj *self, Args *args){
    int res = _bluetooth_BLE_config_addr_rxbuf_get(self);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_config_addr_rxbuf_get,
    "config_addr_rxbuf_get", ""
);

void _bluetooth_BLE_config_bond_getMethod(PikaObj *self, Args *args){
    int res = _bluetooth_BLE_config_bond_get(self);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_config_bond_get,
    "config_bond_get", ""
);

