HelloDuoLA/esp32_ble/components/PikaPython/pikascript-api/__pikaBinding.c
void _bluetooth_BLE_config_bond_updateMethod(PikaObj *self, Args *args){
    pika_bool bond = args_getBool(args, "bond");
    int res = _bluetooth_BLE_config_bond_update(self, bond);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_config_bond_update,
    "config_bond_update", "bond"
);

void _bluetooth_BLE_config_gap_name_getMethod(PikaObj *self, Args *args){
    char* res = _bluetooth_BLE_config_gap_name_get(self);
    method_returnStr(args, res);
}
method_typedef(
    _bluetooth_BLE_config_gap_name_get,
    "config_gap_name_get", ""
);

void _bluetooth_BLE_config_gap_name_updateMethod(PikaObj *self, Args *args){
    char* gap_name = args_getStr(args, "gap_name");
    int res = _bluetooth_BLE_config_gap_name_update(self, gap_name);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_config_gap_name_update,
    "config_gap_name_update", "gap_name"
);

void _bluetooth_BLE_config_io_getMethod(PikaObj *self, Args *args){
    int res = _bluetooth_BLE_config_io_get(self);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_config_io_get,
    "config_io_get", ""
);

void _bluetooth_BLE_config_io_updateMethod(PikaObj *self, Args *args){
    int io = args_getInt(args, "io");
    int res = _bluetooth_BLE_config_io_update(self, io);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_config_io_update,
    "config_io_update", "io"
);

void _bluetooth_BLE_config_le_secure_getMethod(PikaObj *self, Args *args){
    int res = _bluetooth_BLE_config_le_secure_get(self);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_config_le_secure_get,
    "config_le_secure_get", ""
);

void _bluetooth_BLE_config_le_secure_updateMethod(PikaObj *self, Args *args){
    pika_bool le_secure = args_getBool(args, "le_secure");
    int res = _bluetooth_BLE_config_le_secure_update(self, le_secure);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_config_le_secure_update,
    "config_le_secure_update", "le_secure"
);

void _bluetooth_BLE_config_mac_getMethod(PikaObj *self, Args *args){
    int res = _bluetooth_BLE_config_mac_get(self);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_config_mac_get,
    "config_mac_get", ""
);

void _bluetooth_BLE_config_mac_updateMethod(PikaObj *self, Args *args){
    int res = _bluetooth_BLE_config_mac_update(self);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_config_mac_update,
    "config_mac_update", ""
);

void _bluetooth_BLE_config_mitm_getMethod(PikaObj *self, Args *args){
    int res = _bluetooth_BLE_config_mitm_get(self);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_config_mitm_get,
    "config_mitm_get", ""
);

void _bluetooth_BLE_config_mitm_updateMethod(PikaObj *self, Args *args){
    pika_bool mitm = args_getBool(args, "mitm");
    int res = _bluetooth_BLE_config_mitm_update(self, mitm);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_config_mitm_update,
    "config_mitm_update", "mitm"
);

void _bluetooth_BLE_config_mtu_getMethod(PikaObj *self, Args *args){
    int res = _bluetooth_BLE_config_mtu_get(self);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_config_mtu_get,
    "config_mtu_get", ""
);

void _bluetooth_BLE_config_mtu_updateMethod(PikaObj *self, Args *args){
    int mtu = args_getInt(args, "mtu");
    int res = _bluetooth_BLE_config_mtu_update(self, mtu);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_config_mtu_update,
    "config_mtu_update", "mtu"
);

void _bluetooth_BLE_config_rxbuf_updateMethod(PikaObj *self, Args *args){
    int rxbuf = args_getInt(args, "rxbuf");
    int res = _bluetooth_BLE_config_rxbuf_update(self, rxbuf);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_config_rxbuf_update,
    "config_rxbuf_update", "rxbuf"
);

void _bluetooth_BLE_gap_connectMethod(PikaObj *self, Args *args){
    int addr_type = args_getInt(args, "addr_type");
    char* addr = args_getStr(args, "addr");
    int scan_duration_ms = args_getInt(args, "scan_duration_ms");
    int res = _bluetooth_BLE_gap_connect(self, addr_type, addr, scan_duration_ms);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_gap_connect,
    "gap_connect", "addr_type,addr,scan_duration_ms"
);

void _bluetooth_BLE_gap_disconnectMethod(PikaObj *self, Args *args){
    int res = _bluetooth_BLE_gap_disconnect(self);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_gap_disconnect,
    "gap_disconnect", ""
);

void _bluetooth_BLE_gap_scanMethod(PikaObj *self, Args *args){
    int addr_mode = args_getInt(args, "addr_mode");
    int duration_ms = args_getInt(args, "duration_ms");
    int interval_us = args_getInt(args, "interval_us");
    int window_us = args_getInt(args, "window_us");
    pika_bool active = args_getBool(args, "active");
    int res = _bluetooth_BLE_gap_scan(self, addr_mode, duration_ms, interval_us, window_us, active);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_gap_scan,
    "gap_scan", "addr_mode,duration_ms,interval_us,window_us,active"
);

void _bluetooth_BLE_gap_stop_scanMethod(PikaObj *self, Args *args){
    int res = _bluetooth_BLE_gap_stop_scan(self);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_gap_stop_scan,
    "gap_stop_scan", ""
);

void _bluetooth_BLE_gattc_dis_chrsMethod(PikaObj *self, Args *args){
    int conn_handle = args_getInt(args, "conn_handle");
    int start_handle = args_getInt(args, "start_handle");
    int end_handle = args_getInt(args, "end_handle");
    int res = _bluetooth_BLE_gattc_dis_chrs(self, conn_handle, start_handle, end_handle);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_gattc_dis_chrs,
    "gattc_dis_chrs", "conn_handle,start_handle,end_handle"
);

void _bluetooth_BLE_gattc_dis_chrs_by_uuidMethod(PikaObj *self, Args *args){
    int conn_handle = args_getInt(args, "conn_handle");
    int start_handle = args_getInt(args, "start_handle");
    char* uuid = args_getStr(args, "uuid");
    int res = _bluetooth_BLE_gattc_dis_chrs_by_uuid(self, conn_handle, start_handle, uuid);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_gattc_dis_chrs_by_uuid,
    "gattc_dis_chrs_by_uuid", "conn_handle,start_handle,uuid"
);

void _bluetooth_BLE_gattc_dis_dscsMethod(PikaObj *self, Args *args){
    int conn_handle = args_getInt(args, "conn_handle");
    int start_handle = args_getInt(args, "start_handle");
    int end_handle = args_getInt(args, "end_handle");
    int res = _bluetooth_BLE_gattc_dis_dscs(self, conn_handle, start_handle, end_handle);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_gattc_dis_dscs,
    "gattc_dis_dscs", "conn_handle,start_handle,end_handle"
);

void _bluetooth_BLE_gattc_dis_svcsMethod(PikaObj *self, Args *args){
    int conn_handle = args_getInt(args, "conn_handle");
    int res = _bluetooth_BLE_gattc_dis_svcs(self, conn_handle);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_gattc_dis_svcs,
    "gattc_dis_svcs", "conn_handle"
);

