HelloDuoLA/esp32_ble/components/PikaPython/pikascript-api/__pikaBinding.c
void _bluetooth_BLE_gattc_dis_svcs_by_uuidMethod(PikaObj *self, Args *args){
    int conn_handle = args_getInt(args, "conn_handle");
    char* uuid = args_getStr(args, "uuid");
    int res = _bluetooth_BLE_gattc_dis_svcs_by_uuid(self, conn_handle, uuid);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_gattc_dis_svcs_by_uuid,
    "gattc_dis_svcs_by_uuid", "conn_handle,uuid"
);

void _bluetooth_BLE_gattc_write_with_no_rspMethod(PikaObj *self, Args *args){
    int conn_handle = args_getInt(args, "conn_handle");
    int value_handle = args_getInt(args, "value_handle");
    char* data = args_getStr(args, "data");
    int res = _bluetooth_BLE_gattc_write_with_no_rsp(self, conn_handle, value_handle, data);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_gattc_write_with_no_rsp,
    "gattc_write_with_no_rsp", "conn_handle,value_handle,data"
);

void _bluetooth_BLE_gattc_write_with_rspMethod(PikaObj *self, Args *args){
    int conn_handle = args_getInt(args, "conn_handle");
    int value_handle = args_getInt(args, "value_handle");
    char* data = args_getStr(args, "data");
    int res = _bluetooth_BLE_gattc_write_with_rsp(self, conn_handle, value_handle, data);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_gattc_write_with_rsp,
    "gattc_write_with_rsp", "conn_handle,value_handle,data"
);

void _bluetooth_BLE_gatts_indicate_customMethod(PikaObj *self, Args *args){
    int conn_handle = args_getInt(args, "conn_handle");
    int value_handle = args_getInt(args, "value_handle");
    char* data = args_getStr(args, "data");
    int res = _bluetooth_BLE_gatts_indicate_custom(self, conn_handle, value_handle, data);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_gatts_indicate_custom,
    "gatts_indicate_custom", "conn_handle,value_handle,data"
);

void _bluetooth_BLE_gatts_indicate_no_dataMethod(PikaObj *self, Args *args){
    int conn_handle = args_getInt(args, "conn_handle");
    int value_handle = args_getInt(args, "value_handle");
    int res = _bluetooth_BLE_gatts_indicate_no_data(self, conn_handle, value_handle);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_gatts_indicate_no_data,
    "gatts_indicate_no_data", "conn_handle,value_handle"
);

void _bluetooth_BLE_gatts_notify_customMethod(PikaObj *self, Args *args){
    int conn_handle = args_getInt(args, "conn_handle");
    int value_handle = args_getInt(args, "value_handle");
    char* data = args_getStr(args, "data");
    int res = _bluetooth_BLE_gatts_notify_custom(self, conn_handle, value_handle, data);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_gatts_notify_custom,
    "gatts_notify_custom", "conn_handle,value_handle,data"
);

void _bluetooth_BLE_gatts_notify_no_dataMethod(PikaObj *self, Args *args){
    int conn_handle = args_getInt(args, "conn_handle");
    int value_handle = args_getInt(args, "value_handle");
    int res = _bluetooth_BLE_gatts_notify_no_data(self, conn_handle, value_handle);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_gatts_notify_no_data,
    "gatts_notify_no_data", "conn_handle,value_handle"
);

void _bluetooth_BLE_gatts_register_svcsMethod(PikaObj *self, Args *args){
    PikaObj* services_info = args_getPtr(args, "services_info");
    int res = _bluetooth_BLE_gatts_register_svcs(self, services_info);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_gatts_register_svcs,
    "gatts_register_svcs", "services_info"
);

void _bluetooth_BLE_initMethod(PikaObj *self, Args *args){
    int res = _bluetooth_BLE_init(self);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_init,
    "init", ""
);

void _bluetooth_BLE_pyi_activeMethod(PikaObj *self, Args *args){
    pika_bool active = args_getBool(args, "active");
    pika_bool res = _bluetooth_BLE_pyi_active(self, active);
    method_returnBool(args, res);
}
method_typedef(
    _bluetooth_BLE_pyi_active,
    "pyi_active", "active"
);

void _bluetooth_BLE_pyi_check_activeMethod(PikaObj *self, Args *args){
    pika_bool res = _bluetooth_BLE_pyi_check_active(self);
    method_returnBool(args, res);
}
method_typedef(
    _bluetooth_BLE_pyi_check_active,
    "pyi_check_active", ""
);

void _bluetooth_BLE_pyi_gattc_exchange_mtuMethod(PikaObj *self, Args *args){
    int conn_handle = args_getInt(args, "conn_handle");
    int res = _bluetooth_BLE_pyi_gattc_exchange_mtu(self, conn_handle);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_pyi_gattc_exchange_mtu,
    "pyi_gattc_exchange_mtu", "conn_handle"
);

void _bluetooth_BLE_pyi_gattc_readMethod(PikaObj *self, Args *args){
    int conn_handle = args_getInt(args, "conn_handle");
    int value_handle = args_getInt(args, "value_handle");
    int res = _bluetooth_BLE_pyi_gattc_read(self, conn_handle, value_handle);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_pyi_gattc_read,
    "pyi_gattc_read", "conn_handle,value_handle"
);

void _bluetooth_BLE_pyi_testMethod(PikaObj *self, Args *args){
    int res = _bluetooth_BLE_pyi_test(self);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_pyi_test,
    "pyi_test", ""
);

void _bluetooth_BLE_setCallbackMethod(PikaObj *self, Args *args){
    Arg* cb = args_getArg(args, "cb");
    _bluetooth_BLE_setCallback(self, cb);
}
method_typedef(
    _bluetooth_BLE_setCallback,
    "setCallback", "cb"
);

void _bluetooth_BLE_set_adv_dataMethod(PikaObj *self, Args *args){
    char* data = args_getStr(args, "data");
    int data_len = args_getInt(args, "data_len");
    int res = _bluetooth_BLE_set_adv_data(self, data, data_len);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_set_adv_data,
    "set_adv_data", "data,data_len"
);

void _bluetooth_BLE_set_rsp_dataMethod(PikaObj *self, Args *args){
    char* data = args_getStr(args, "data");
    int data_len = args_getInt(args, "data_len");
    int res = _bluetooth_BLE_set_rsp_data(self, data, data_len);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_set_rsp_data,
    "set_rsp_data", "data,data_len"
);

void _bluetooth_BLE_stop_advertiseMethod(PikaObj *self, Args *args){
    int res = _bluetooth_BLE_stop_advertise(self);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_stop_advertise,
    "stop_advertise", ""
);

