HelloDuoLA/esp32_ble/components/PikaPython/pikascript-api/__pikaBinding.c
void _bluetooth_BLE_test2Method(PikaObj *self, Args *args){
    int res = _bluetooth_BLE_test2(self);
    method_returnInt(args, res);
}
method_typedef(
    _bluetooth_BLE_test2,
    "test2", ""
);

class_def(_bluetooth_BLE){
    __BEFORE_MOETHOD_DEF
    method_def(_bluetooth_BLE_gatts_notify_no_data, 40343445),
    method_def(_bluetooth_BLE_config_addr_mode_get, 44719256),
    method_def(_bluetooth_BLE_config_le_secure_update, 107547187),
    method_def(_bluetooth_BLE_gap_connect, 239981286),
    method_def(_bluetooth_BLE_gap_stop_scan, 257876614),
    method_def(_bluetooth_BLE_stop_advertise, 259007825),
    method_def(_bluetooth_BLE_test2, 275477815),
    method_def(_bluetooth_BLE_config_gap_name_update, 408105012),
    method_def(_bluetooth_BLE_config_mtu_get, 476449967),
    method_def(_bluetooth_BLE_config_bond_update, 554500607),
    method_def(_bluetooth_BLE_config_io_get, 632087889),
    method_def(_bluetooth_BLE_gatts_indicate_no_data, 659684477),
    method_def(_bluetooth_BLE_gap_disconnect, 714357958),
    method_def(_bluetooth_BLE_pyi_gattc_read, 774405380),
    method_def(_bluetooth_BLE_gattc_write_with_no_rsp, 783500045),
    method_def(_bluetooth_BLE_gattc_dis_chrs_by_uuid, 796024214),
    method_def(_bluetooth_BLE_config_mtu_update, 855813778),
    method_def(_bluetooth_BLE_set_adv_data, 862102692),
    method_def(_bluetooth_BLE_pyi_test, 917323382),
    method_def(_bluetooth_BLE_setCallback, 946882526),
    method_def(_bluetooth_BLE_gattc_write_with_rsp, 1004539761),
    method_def(_bluetooth_BLE_pyi_gattc_exchange_mtu, 1055431712),
    method_def(_bluetooth_BLE_gap_scan, 1094358433),
    method_def(_bluetooth_BLE_gatts_register_svcs, 1155607722),
    method_def(_bluetooth_BLE_gattc_dis_chrs, 1280754246),
    method_def(_bluetooth_BLE_gattc_dis_dscs, 1280801667),
    method_def(_bluetooth_BLE_gattc_dis_svcs, 1281343989),
    method_def(_bluetooth_BLE_config_mitm_update, 1292142323),
    method_def(_bluetooth_BLE_gattc_dis_svcs_by_uuid, 1293655109),
    method_def(_bluetooth_BLE_advertise, 1312546732),
    method_def(_bluetooth_BLE_config_addr_mode_update, 1318609371),
    method_def(_bluetooth_BLE_set_rsp_data, 1483498270),
    method_def(_bluetooth_BLE_config_mitm_get, 1493883056),
    method_def(_bluetooth_BLE_pyi_active, 1786833970),
    method_def(_bluetooth_BLE_config_mac_get, 1859014570),
    method_def(_bluetooth_BLE_config_mac_update, 1898271661),
    method_def(_bluetooth_BLE_config_bond_get, 1903316796),
    method_def(_bluetooth_BLE_config_rxbuf_update, 1924795427),
    method_def(_bluetooth_BLE_config_le_secure_get, 1959535600),
    method_def(_bluetooth_BLE_config_io_update, 1968397300),
    method_def(_bluetooth_BLE_gatts_indicate_custom, 2005137954),
    method_def(_bluetooth_BLE_config_addr_rxbuf_get, 2022506650),
    method_def(_bluetooth_BLE_gatts_notify_custom, 2051445306),
    method_def(_bluetooth_BLE_config_gap_name_get, 2070094225),
    method_def(_bluetooth_BLE_init, 2090370361),
    method_def(_bluetooth_BLE_pyi_check_active, 2103615151),
};
class_inhert(_bluetooth_BLE, TinyObj);

PikaObj *New__bluetooth_BLE(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, _bluetooth_BLE);
    return self;
}

Arg *_bluetooth_BLE(PikaObj *self){
    return obj_newObjInPackage(New__bluetooth_BLE);
}
#endif

#ifndef PIKA_MODULE__NETWORK_DISABLE
void _network_WLANMethod(PikaObj *self, Args *args){
    Arg* res = _network_WLAN(self);
    method_returnArg(args, res);
}
method_typedef(
    _network_WLAN,
    "WLAN", ""
);

void _network___init__Method(PikaObj *self, Args *args){
    _network___init__(self);
}
method_typedef(
    _network___init__,
    "__init__", ""
);

class_def(_network){
    __BEFORE_MOETHOD_DEF
    method_def(_network___init__, 904762485),
    constructor_def(_network_WLAN, 2089685111),
};
class_inhert(_network, TinyObj);

PikaObj *New__network(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, _network);
    return self;
}
#endif

#ifndef PIKA_MODULE__NETWORK_DISABLE
void _network_WLAN___init__Method(PikaObj *self, Args *args){
    int interface_id = args_getInt(args, "interface_id");
    _network_WLAN___init__(self, interface_id);
}
method_typedef(
    _network_WLAN___init__,
    "__init__", "interface_id"
);

void _network_WLAN_activeMethod(PikaObj *self, Args *args){
    int is_active = args_getInt(args, "is_active");
    _network_WLAN_active(self, is_active);
}
method_typedef(
    _network_WLAN_active,
    "active", "is_active"
);

void _network_WLAN_checkActiveMethod(PikaObj *self, Args *args){
    int res = _network_WLAN_checkActive(self);
    method_returnInt(args, res);
}
method_typedef(
    _network_WLAN_checkActive,
    "checkActive", ""
);

void _network_WLAN_checkConfigMethod(PikaObj *self, Args *args){
    char* param = args_getStr(args, "param");
    Arg* res = _network_WLAN_checkConfig(self, param);
    method_returnArg(args, res);
}
method_typedef(
    _network_WLAN_checkConfig,
    "checkConfig", "param"
);

void _network_WLAN_checkIfconfigMethod(PikaObj *self, Args *args){
    PikaObj* res = _network_WLAN_checkIfconfig(self);
    method_returnObj(args, res);
}
method_typedef(
    _network_WLAN_checkIfconfig,
    "checkIfconfig", ""
);

void _network_WLAN_closeMethod(PikaObj *self, Args *args){
    _network_WLAN_close(self);
}
method_typedef(
    _network_WLAN_close,
    "close", ""
);

void _network_WLAN_configMethod(PikaObj *self, Args *args){
    PikaDict* kwargs = args_getDict(args, "kwargs");
    _network_WLAN_config(self, kwargs);
}
method_typedef(
    _network_WLAN_config,
    "config", "**kwargs"
);

void _network_WLAN_connectMethod(PikaObj *self, Args *args){
    char* ssid = args_getStr(args, "ssid");
    char* key = args_getStr(args, "key");
    _network_WLAN_connect(self, ssid, key);
}
method_typedef(
    _network_WLAN_connect,
    "connect", "ssid,key"
);

void _network_WLAN_connectWithBssidMethod(PikaObj *self, Args *args){
    char* ssid = args_getStr(args, "ssid");
    char* key = args_getStr(args, "key");
    char* bssid = args_getStr(args, "bssid");
    _network_WLAN_connectWithBssid(self, ssid, key, bssid);
}
method_typedef(
    _network_WLAN_connectWithBssid,
    "connectWithBssid", "ssid,key,bssid"
);

void _network_WLAN_disconnectMethod(PikaObj *self, Args *args){
    _network_WLAN_disconnect(self);
}
method_typedef(
    _network_WLAN_disconnect,
    "disconnect", ""
);

void _network_WLAN_ifconfigMethod(PikaObj *self, Args *args){
    char* ip = args_getStr(args, "ip");
    char* mask = args_getStr(args, "mask");
    char* gateway = args_getStr(args, "gateway");
    char* dns = args_getStr(args, "dns");
    _network_WLAN_ifconfig(self, ip, mask, gateway, dns);
}
method_typedef(
    _network_WLAN_ifconfig,
    "ifconfig", "ip,mask,gateway,dns"
);

void _network_WLAN_isconnectedMethod(PikaObj *self, Args *args){
    int res = _network_WLAN_isconnected(self);
    method_returnInt(args, res);
}
method_typedef(
    _network_WLAN_isconnected,
    "isconnected", ""
);

