HelloDuoLA/esp32_ble/components/PikaPython/pikascript-api/__pikaBinding.c
void _network_WLAN_scanMethod(PikaObj *self, Args *args){
    PikaObj* res = _network_WLAN_scan(self);
    method_returnObj(args, res);
}
method_typedef(
    _network_WLAN_scan,
    "scan", ""
);

void _network_WLAN_statusMethod(PikaObj *self, Args *args){
    int res = _network_WLAN_status(self);
    method_returnInt(args, res);
}
method_typedef(
    _network_WLAN_status,
    "status", ""
);

void _network_WLAN_statusWithParamMethod(PikaObj *self, Args *args){
    char* param = args_getStr(args, "param");
    int res = _network_WLAN_statusWithParam(self, param);
    method_returnInt(args, res);
}
method_typedef(
    _network_WLAN_statusWithParam,
    "statusWithParam", "param"
);

class_def(_network_WLAN){
    __BEFORE_MOETHOD_DEF
    method_def(_network_WLAN_disconnect, 35797775),
    method_def(_network_WLAN_isconnected, 122933684),
    method_def(_network_WLAN_close, 255564379),
    method_def(_network_WLAN_status, 478842185),
    method_def(_network_WLAN_statusWithParam, 669129430),
    method_def(_network_WLAN___init__, 904762485),
    method_def(_network_WLAN_checkActive, 1083463551),
    method_def(_network_WLAN_checkConfig, 1175746073),
    method_def(_network_WLAN_connect, 1400262095),
    method_def(_network_WLAN_checkIfconfig, 1489379336),
    method_def(_network_WLAN_connectWithBssid, 1620729632),
    method_def(_network_WLAN_active, 1902398945),
    method_def(_network_WLAN_config, 1994681467),
    method_def(_network_WLAN_scan, 2090717482),
    method_def(_network_WLAN_ifconfig, 2104309482),
};
class_inhert(_network_WLAN, TinyObj);

PikaObj *New__network_WLAN(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, _network_WLAN);
    return self;
}

Arg *_network_WLAN(PikaObj *self){
    return obj_newObjInPackage(New__network_WLAN);
}
#endif

#ifndef PIKA_MODULE__TIME_DISABLE
void _time___init__Method(PikaObj *self, Args *args){
    _time___init__(self);
}
method_typedef(
    _time___init__,
    "__init__", ""
);

void _time_asctimeMethod(PikaObj *self, Args *args){
    _time_asctime(self);
}
method_typedef(
    _time_asctime,
    "asctime", ""
);

void _time_ctimeMethod(PikaObj *self, Args *args){
    pika_float unix_time = args_getFloat(args, "unix_time");
    _time_ctime(self, unix_time);
}
method_typedef(
    _time_ctime,
    "ctime", "unix_time"
);

void _time_gmtimeMethod(PikaObj *self, Args *args){
    pika_float unix_time = args_getFloat(args, "unix_time");
    _time_gmtime(self, unix_time);
}
method_typedef(
    _time_gmtime,
    "gmtime", "unix_time"
);

void _time_localtimeMethod(PikaObj *self, Args *args){
    pika_float unix_time = args_getFloat(args, "unix_time");
    _time_localtime(self, unix_time);
}
method_typedef(
    _time_localtime,
    "localtime", "unix_time"
);

void _time_mktimeMethod(PikaObj *self, Args *args){
    int res = _time_mktime(self);
    method_returnInt(args, res);
}
method_typedef(
    _time_mktime,
    "mktime", ""
);

void _time_platformGetTickMethod(PikaObj *self, Args *args){
    _time_platformGetTick(self);
}
method_typedef(
    _time_platformGetTick,
    "platformGetTick", ""
);

void _time_sleep_msMethod(PikaObj *self, Args *args){
    int ms = args_getInt(args, "ms");
    _time_sleep_ms(self, ms);
}
method_typedef(
    _time_sleep_ms,
    "sleep_ms", "ms"
);

void _time_sleep_sMethod(PikaObj *self, Args *args){
    int s = args_getInt(args, "s");
    _time_sleep_s(self, s);
}
method_typedef(
    _time_sleep_s,
    "sleep_s", "s"
);

void _time_timeMethod(PikaObj *self, Args *args){
    pika_float res = _time_time(self);
    method_returnFloat(args, res);
}
method_typedef(
    _time_time,
    "time", ""
);

void _time_time_nsMethod(PikaObj *self, Args *args){
    int res = _time_time_ns(self);
    method_returnInt(args, res);
}
method_typedef(
    _time_time_ns,
    "time_ns", ""
);

class_def(_time){
    __BEFORE_MOETHOD_DEF
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(_time_gmtime, 1586568),
#endif
    method_def(_time_sleep_ms, 164842493),
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(_time_mktime, 234027084),
#endif
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(_time_ctime, 255845143),
#endif
    method_def(_time_sleep_s, 460522064),
    method_def(_time___init__, 904762485),
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(_time_localtime, 907356095),
#endif
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(_time_asctime, 1108526539),
#endif
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(_time_time_ns, 1644053204),
#endif
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(_time_platformGetTick, 1897947957),
#endif
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(_time_time, 2090760340),
#endif
};
class_inhert(_time, TinyObj);

PikaObj *New__time(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, _time);
    return self;
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
void builtins_ArithmeticErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_ArithmeticError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_ArithmeticError,
    "ArithmeticError", ""
);

void builtins_AssertionErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_AssertionError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_AssertionError,
    "AssertionError", ""
);

void builtins_AttributeErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_AttributeError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_AttributeError,
    "AttributeError", ""
);

void builtins_BaseExceptionMethod(PikaObj *self, Args *args){
    Arg* res = builtins_BaseException(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_BaseException,
    "BaseException", ""
);

void builtins_BlockingIOErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_BlockingIOError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_BlockingIOError,
    "BlockingIOError", ""
);

void builtins_BrokenPipeErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_BrokenPipeError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_BrokenPipeError,
    "BrokenPipeError", ""
);

void builtins_BufferErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_BufferError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_BufferError,
    "BufferError", ""
);

void builtins_BytesWarningMethod(PikaObj *self, Args *args){
    Arg* res = builtins_BytesWarning(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_BytesWarning,
    "BytesWarning", ""
);

void builtins_ChildProcessErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_ChildProcessError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_ChildProcessError,
    "ChildProcessError", ""
);

void builtins_ConnectionAbortedErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_ConnectionAbortedError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_ConnectionAbortedError,
    "ConnectionAbortedError", ""
);

void builtins_ConnectionErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_ConnectionError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_ConnectionError,
    "ConnectionError", ""
);

void builtins_ConnectionRefusedErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_ConnectionRefusedError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_ConnectionRefusedError,
    "ConnectionRefusedError", ""
);

void builtins_ConnectionResetErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_ConnectionResetError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_ConnectionResetError,
    "ConnectionResetError", ""
);

void builtins_DeprecationWarningMethod(PikaObj *self, Args *args){
    Arg* res = builtins_DeprecationWarning(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_DeprecationWarning,
    "DeprecationWarning", ""
);

void builtins_EOFErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_EOFError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_EOFError,
    "EOFError", ""
);

void builtins_ExceptionMethod(PikaObj *self, Args *args){
    Arg* res = builtins_Exception(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_Exception,
    "Exception", ""
);

void builtins_FileExistsErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_FileExistsError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_FileExistsError,
    "FileExistsError", ""
);

void builtins_FileNotFoundErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_FileNotFoundError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_FileNotFoundError,
    "FileNotFoundError", ""
);

void builtins_FloatingPointErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_FloatingPointError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_FloatingPointError,
    "FloatingPointError", ""
);

void builtins_FutureWarningMethod(PikaObj *self, Args *args){
    Arg* res = builtins_FutureWarning(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_FutureWarning,
    "FutureWarning", ""
);

