HelloDuoLA/esp32_ble/components/PikaPython/pikascript-api/__pikaBinding.c
void builtins_GeneratorExitMethod(PikaObj *self, Args *args){
    Arg* res = builtins_GeneratorExit(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_GeneratorExit,
    "GeneratorExit", ""
);

void builtins_ImportErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_ImportError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_ImportError,
    "ImportError", ""
);

void builtins_ImportWarningMethod(PikaObj *self, Args *args){
    Arg* res = builtins_ImportWarning(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_ImportWarning,
    "ImportWarning", ""
);

void builtins_IndentationErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_IndentationError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_IndentationError,
    "IndentationError", ""
);

void builtins_IndexErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_IndexError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_IndexError,
    "IndexError", ""
);

void builtins_InterruptedErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_InterruptedError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_InterruptedError,
    "InterruptedError", ""
);

void builtins_IsADirectoryErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_IsADirectoryError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_IsADirectoryError,
    "IsADirectoryError", ""
);

void builtins_KeyErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_KeyError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_KeyError,
    "KeyError", ""
);

void builtins_KeyboardInterruptMethod(PikaObj *self, Args *args){
    Arg* res = builtins_KeyboardInterrupt(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_KeyboardInterrupt,
    "KeyboardInterrupt", ""
);

void builtins_LookupErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_LookupError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_LookupError,
    "LookupError", ""
);

void builtins_MemoryErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_MemoryError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_MemoryError,
    "MemoryError", ""
);

void builtins_ModuleNotFoundErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_ModuleNotFoundError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_ModuleNotFoundError,
    "ModuleNotFoundError", ""
);

void builtins_NameErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_NameError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_NameError,
    "NameError", ""
);

void builtins_NotADirectoryErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_NotADirectoryError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_NotADirectoryError,
    "NotADirectoryError", ""
);

void builtins_NotImplementedErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_NotImplementedError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_NotImplementedError,
    "NotImplementedError", ""
);

void builtins_OSErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_OSError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_OSError,
    "OSError", ""
);

void builtins_OverflowErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_OverflowError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_OverflowError,
    "OverflowError", ""
);

void builtins_PendingDeprecationWarningMethod(PikaObj *self, Args *args){
    Arg* res = builtins_PendingDeprecationWarning(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_PendingDeprecationWarning,
    "PendingDeprecationWarning", ""
);

void builtins_PermissionErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_PermissionError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_PermissionError,
    "PermissionError", ""
);

void builtins_ProcessLookupErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_ProcessLookupError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_ProcessLookupError,
    "ProcessLookupError", ""
);

void builtins_RangeObjMethod(PikaObj *self, Args *args){
    Arg* res = builtins_RangeObj(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_RangeObj,
    "RangeObj", ""
);

void builtins_RecursionErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_RecursionError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_RecursionError,
    "RecursionError", ""
);

void builtins_ReferenceErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_ReferenceError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_ReferenceError,
    "ReferenceError", ""
);

void builtins_ResourceWarningMethod(PikaObj *self, Args *args){
    Arg* res = builtins_ResourceWarning(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_ResourceWarning,
    "ResourceWarning", ""
);

void builtins_RuntimeErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_RuntimeError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_RuntimeError,
    "RuntimeError", ""
);

void builtins_RuntimeWarningMethod(PikaObj *self, Args *args){
    Arg* res = builtins_RuntimeWarning(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_RuntimeWarning,
    "RuntimeWarning", ""
);

void builtins_StopAsyncIterationMethod(PikaObj *self, Args *args){
    Arg* res = builtins_StopAsyncIteration(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_StopAsyncIteration,
    "StopAsyncIteration", ""
);

void builtins_StopIterationMethod(PikaObj *self, Args *args){
    Arg* res = builtins_StopIteration(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_StopIteration,
    "StopIteration", ""
);

void builtins_StringObjMethod(PikaObj *self, Args *args){
    Arg* res = builtins_StringObj(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_StringObj,
    "StringObj", ""
);

void builtins_SyntaxErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_SyntaxError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_SyntaxError,
    "SyntaxError", ""
);

