HelloDuoLA/esp32_ble/components/PikaPython/pikascript-api/__pikaBinding.c
void builtins_SyntaxWarningMethod(PikaObj *self, Args *args){
    Arg* res = builtins_SyntaxWarning(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_SyntaxWarning,
    "SyntaxWarning", ""
);

void builtins_SystemErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_SystemError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_SystemError,
    "SystemError", ""
);

void builtins_SystemExitMethod(PikaObj *self, Args *args){
    Arg* res = builtins_SystemExit(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_SystemExit,
    "SystemExit", ""
);

void builtins_TabErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_TabError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_TabError,
    "TabError", ""
);

void builtins_TimeoutErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_TimeoutError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_TimeoutError,
    "TimeoutError", ""
);

void builtins_TypeErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_TypeError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_TypeError,
    "TypeError", ""
);

void builtins_UnboundLocalErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_UnboundLocalError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_UnboundLocalError,
    "UnboundLocalError", ""
);

void builtins_UnicodeDecodeErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_UnicodeDecodeError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_UnicodeDecodeError,
    "UnicodeDecodeError", ""
);

void builtins_UnicodeEncodeErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_UnicodeEncodeError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_UnicodeEncodeError,
    "UnicodeEncodeError", ""
);

void builtins_UnicodeErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_UnicodeError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_UnicodeError,
    "UnicodeError", ""
);

void builtins_UnicodeTranslateErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_UnicodeTranslateError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_UnicodeTranslateError,
    "UnicodeTranslateError", ""
);

void builtins_UnicodeWarningMethod(PikaObj *self, Args *args){
    Arg* res = builtins_UnicodeWarning(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_UnicodeWarning,
    "UnicodeWarning", ""
);

void builtins_UserWarningMethod(PikaObj *self, Args *args){
    Arg* res = builtins_UserWarning(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_UserWarning,
    "UserWarning", ""
);

void builtins_ValueErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_ValueError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_ValueError,
    "ValueError", ""
);

void builtins_WarningMethod(PikaObj *self, Args *args){
    Arg* res = builtins_Warning(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_Warning,
    "Warning", ""
);

void builtins_ZeroDivisionErrorMethod(PikaObj *self, Args *args){
    Arg* res = builtins_ZeroDivisionError(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_ZeroDivisionError,
    "ZeroDivisionError", ""
);

void builtins___getitem__Method(PikaObj *self, Args *args){
    Arg* obj = args_getArg(args, "obj");
    Arg* key = args_getArg(args, "key");
    Arg* res = builtins___getitem__(self, obj, key);
    method_returnArg(args, res);
}
method_typedef(
    builtins___getitem__,
    "__getitem__", "obj,key"
);

void builtins___setitem__Method(PikaObj *self, Args *args){
    Arg* obj = args_getArg(args, "obj");
    Arg* key = args_getArg(args, "key");
    Arg* val = args_getArg(args, "val");
    Arg* res = builtins___setitem__(self, obj, key, val);
    method_returnArg(args, res);
}
method_typedef(
    builtins___setitem__,
    "__setitem__", "obj,key,val"
);

void builtins_absMethod(PikaObj *self, Args *args){
    Arg* val = args_getArg(args, "val");
    Arg* res = builtins_abs(self, val);
    method_returnArg(args, res);
}
method_typedef(
    builtins_abs,
    "abs", "val"
);

void builtins_boolMethod(PikaObj *self, Args *args){
    Arg* arg = args_getArg(args, "arg");
    pika_bool res = builtins_bool(self, arg);
    method_returnBool(args, res);
}
method_typedef(
    builtins_bool,
    "bool", "arg"
);

void builtins_bytearrayMethod(PikaObj *self, Args *args){
    Arg* res = builtins_bytearray(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_bytearray,
    "bytearray", ""
);

void builtins_bytesMethod(PikaObj *self, Args *args){
    Arg* val = args_getArg(args, "val");
    Arg* res = builtins_bytes(self, val);
    method_returnArg(args, res);
}
method_typedef(
    builtins_bytes,
    "bytes", "val"
);

void builtins_cformatMethod(PikaObj *self, Args *args){
    char* fmt = args_getStr(args, "fmt");
    PikaTuple* var = args_getTuple(args, "var");
    char* res = builtins_cformat(self, fmt, var);
    method_returnStr(args, res);
}
method_typedef(
    builtins_cformat,
    "cformat", "fmt,*var"
);

void builtins_chrMethod(PikaObj *self, Args *args){
    int val = args_getInt(args, "val");
    char* res = builtins_chr(self, val);
    method_returnStr(args, res);
}
method_typedef(
    builtins_chr,
    "chr", "val"
);

void builtins_clearMethod(PikaObj *self, Args *args){
    builtins_clear(self);
}
method_typedef(
    builtins_clear,
    "clear", ""
);

void builtins_dictMethod(PikaObj *self, Args *args){
    PikaTuple* val = args_getTuple(args, "val");
    Arg* res = builtins_dict(self, val);
    method_returnArg(args, res);
}
method_typedef(
    builtins_dict,
    "dict", "*val"
);

void builtins_dirMethod(PikaObj *self, Args *args){
    Arg* obj = args_getArg(args, "obj");
    PikaObj* res = builtins_dir(self, obj);
    method_returnObj(args, res);
}
method_typedef(
    builtins_dir,
    "dir", "obj"
);

