HelloDuoLA/esp32_ble/components/PikaPython/pikascript-api/__pikaBinding.c
void builtins_evalMethod(PikaObj *self, Args *args){
    char* code = args_getStr(args, "code");
    Arg* res = builtins_eval(self, code);
    method_returnArg(args, res);
}
method_typedef(
    builtins_eval,
    "eval", "code"
);

void builtins_execMethod(PikaObj *self, Args *args){
    char* code = args_getStr(args, "code");
    builtins_exec(self, code);
}
method_typedef(
    builtins_exec,
    "exec", "code"
);

void builtins_exitMethod(PikaObj *self, Args *args){
    builtins_exit(self);
}
method_typedef(
    builtins_exit,
    "exit", ""
);

void builtins_floatMethod(PikaObj *self, Args *args){
    Arg* arg = args_getArg(args, "arg");
    pika_float res = builtins_float(self, arg);
    method_returnFloat(args, res);
}
method_typedef(
    builtins_float,
    "float", "arg"
);

void builtins_gcdumpMethod(PikaObj *self, Args *args){
    builtins_gcdump(self);
}
method_typedef(
    builtins_gcdump,
    "gcdump", ""
);

void builtins_getattrMethod(PikaObj *self, Args *args){
    PikaObj* obj = args_getPtr(args, "obj");
    char* name = args_getStr(args, "name");
    Arg* res = builtins_getattr(self, obj, name);
    method_returnArg(args, res);
}
method_typedef(
    builtins_getattr,
    "getattr", "obj,name"
);

void builtins_hasattrMethod(PikaObj *self, Args *args){
    PikaObj* obj = args_getPtr(args, "obj");
    char* name = args_getStr(args, "name");
    int res = builtins_hasattr(self, obj, name);
    method_returnInt(args, res);
}
method_typedef(
    builtins_hasattr,
    "hasattr", "obj,name"
);

void builtins_helpMethod(PikaObj *self, Args *args){
    char* name = args_getStr(args, "name");
    builtins_help(self, name);
}
method_typedef(
    builtins_help,
    "help", "name"
);

void builtins_hexMethod(PikaObj *self, Args *args){
    int val = args_getInt(args, "val");
    char* res = builtins_hex(self, val);
    method_returnStr(args, res);
}
method_typedef(
    builtins_hex,
    "hex", "val"
);

void builtins_idMethod(PikaObj *self, Args *args){
    Arg* obj = args_getArg(args, "obj");
    int res = builtins_id(self, obj);
    method_returnInt(args, res);
}
method_typedef(
    builtins_id,
    "id", "obj"
);

void builtins_inputMethod(PikaObj *self, Args *args){
    PikaTuple* info = args_getTuple(args, "info");
    char* res = builtins_input(self, info);
    method_returnStr(args, res);
}
method_typedef(
    builtins_input,
    "input", "*info"
);

void builtins_intMethod(PikaObj *self, Args *args){
    Arg* arg = args_getArg(args, "arg");
    PikaTuple* base = args_getTuple(args, "base");
    Arg* res = builtins_int(self, arg, base);
    method_returnArg(args, res);
}
method_typedef(
    builtins_int,
    "int", "arg,*base"
);

void builtins_isinstanceMethod(PikaObj *self, Args *args){
    Arg* object = args_getArg(args, "object");
    Arg* classinfo = args_getArg(args, "classinfo");
    pika_bool res = builtins_isinstance(self, object, classinfo);
    method_returnBool(args, res);
}
method_typedef(
    builtins_isinstance,
    "isinstance", "object,classinfo"
);

void builtins_iterMethod(PikaObj *self, Args *args){
    Arg* arg = args_getArg(args, "arg");
    Arg* res = builtins_iter(self, arg);
    method_returnArg(args, res);
}
method_typedef(
    builtins_iter,
    "iter", "arg"
);

void builtins_lenMethod(PikaObj *self, Args *args){
    Arg* arg = args_getArg(args, "arg");
    int res = builtins_len(self, arg);
    method_returnInt(args, res);
}
method_typedef(
    builtins_len,
    "len", "arg"
);

void builtins_listMethod(PikaObj *self, Args *args){
    PikaTuple* val = args_getTuple(args, "val");
    Arg* res = builtins_list(self, val);
    method_returnArg(args, res);
}
method_typedef(
    builtins_list,
    "list", "*val"
);

void builtins_maxMethod(PikaObj *self, Args *args){
    PikaTuple* val = args_getTuple(args, "val");
    Arg* res = builtins_max(self, val);
    method_returnArg(args, res);
}
method_typedef(
    builtins_max,
    "max", "*val"
);

void builtins_minMethod(PikaObj *self, Args *args){
    PikaTuple* val = args_getTuple(args, "val");
    Arg* res = builtins_min(self, val);
    method_returnArg(args, res);
}
method_typedef(
    builtins_min,
    "min", "*val"
);

void builtins_objectMethod(PikaObj *self, Args *args){
    Arg* res = builtins_object(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_object,
    "object", ""
);

void builtins_openMethod(PikaObj *self, Args *args){
    char* path = args_getStr(args, "path");
    char* mode = args_getStr(args, "mode");
    PikaObj* res = builtins_open(self, path, mode);
    method_returnObj(args, res);
}
method_typedef(
    builtins_open,
    "open", "path,mode"
);

void builtins_ordMethod(PikaObj *self, Args *args){
    char* val = args_getStr(args, "val");
    int res = builtins_ord(self, val);
    method_returnInt(args, res);
}
method_typedef(
    builtins_ord,
    "ord", "val"
);

void builtins_printMethod(PikaObj *self, Args *args){
    PikaTuple* val = args_getTuple(args, "val");
    PikaDict* ops = args_getDict(args, "ops");
    builtins_print(self, val, ops);
}
method_typedef(
    builtins_print,
    "print", "*val,**ops"
);

void builtins_rangeMethod(PikaObj *self, Args *args){
    PikaTuple* ax = args_getTuple(args, "ax");
    Arg* res = builtins_range(self, ax);
    method_returnArg(args, res);
}
method_typedef(
    builtins_range,
    "range", "*ax"
);

void builtins_rebootMethod(PikaObj *self, Args *args){
    builtins_reboot(self);
}
method_typedef(
    builtins_reboot,
    "reboot", ""
);

void builtins_setattrMethod(PikaObj *self, Args *args){
    PikaObj* obj = args_getPtr(args, "obj");
    char* name = args_getStr(args, "name");
    Arg* val = args_getArg(args, "val");
    builtins_setattr(self, obj, name, val);
}
method_typedef(
    builtins_setattr,
    "setattr", "obj,name,val"
);

void builtins_strMethod(PikaObj *self, Args *args){
    Arg* arg = args_getArg(args, "arg");
    char* res = builtins_str(self, arg);
    method_returnStr(args, res);
}
method_typedef(
    builtins_str,
    "str", "arg"
);

void builtins_tupleMethod(PikaObj *self, Args *args){
    PikaTuple* val = args_getTuple(args, "val");
    Arg* res = builtins_tuple(self, val);
    method_returnArg(args, res);
}
method_typedef(
    builtins_tuple,
    "tuple", "*val"
);

void builtins_typeMethod(PikaObj *self, Args *args){
    Arg* arg = args_getArg(args, "arg");
    Arg* res = builtins_type(self, arg);
    method_returnArg(args, res);
}
method_typedef(
    builtins_type,
    "type", "arg"
);

class_def(builtins){
    __BEFORE_MOETHOD_DEF
    method_def(builtins_id, 5863474),
    constructor_def(builtins_ImportWarning, 11723350),
    constructor_def(builtins_FloatingPointError, 19944365),
    constructor_def(builtins_UnicodeWarning, 83933186),
    constructor_def(builtins_StringObj, 145144695),
    constructor_def(builtins_bytearray, 150321240),
    constructor_def(builtins_SystemExit, 173529092),
    constructor_def(builtins_FileExistsError, 175400911),
    method_def(builtins_abs, 193485979),
    method_def(builtins_chr, 193488354),
    method_def(builtins_dir, 193489476),
    method_def(builtins_hex, 193493706),
    method_def(builtins_int, 193495088),
    method_def(builtins_len, 193498052),
    method_def(builtins_max, 193499019),
    method_def(builtins_min, 193499273),
    method_def(builtins_ord, 193501738),
    method_def(builtins_str, 193506174),
    constructor_def(builtins_OSError, 196451025),
    method_def(builtins_setattr, 204224428),
    constructor_def(builtins_UnicodeError, 247530422),
    method_def(builtins_bytes, 254850636),
    method_def(builtins_clear, 255552908),
    method_def(builtins_float, 259121563),
    method_def(builtins_input, 262752949),
    method_def(builtins_print, 271190290),
    method_def(builtins_range, 272956402),
    method_def(builtins_tuple, 276049327),
    constructor_def(builtins_MemoryError, 282021160),
    constructor_def(builtins_object, 301260540),
    constructor_def(builtins_EOFError, 320116713),
    constructor_def(builtins_ArithmeticError, 351017945),
    constructor_def(builtins_TabError, 366528582),
    constructor_def(builtins_Warning, 391884891),
    method_def(builtins_reboot, 421948272),
    constructor_def(builtins_RuntimeError, 489249939),
    constructor_def(builtins_BufferError, 532402249),
    constructor_def(builtins_StopIteration, 603406554),
    constructor_def(builtins_RecursionError, 650622313),
    constructor_def(builtins_KeyboardInterrupt, 675810883),
    constructor_def(builtins_ConnectionAbortedError, 683722528),
    constructor_def(builtins_PendingDeprecationWarning, 685434382),
    constructor_def(builtins_ChildProcessError, 741086002),
    constructor_def(builtins_NameError, 742300048),
    constructor_def(builtins_AttributeError, 746628451),
    constructor_def(builtins_IsADirectoryError, 758248961),
    constructor_def(builtins_IndexError, 799477063),
    constructor_def(builtins_KeyError, 823649752),
    constructor_def(builtins_UnicodeDecodeError, 838371290),
    method_def(builtins_hasattr, 872734812),
    constructor_def(builtins_BrokenPipeError, 978090846),
    constructor_def(builtins_ZeroDivisionError, 984971860),
    constructor_def(builtins_BlockingIOError, 1002993040),
    constructor_def(builtins_AssertionError, 1016945095),
    constructor_def(builtins_ResourceWarning, 1029444419),
    constructor_def(builtins_LookupError, 1035868745),
    constructor_def(builtins_StopAsyncIteration, 1038138136),
    method_def(builtins_cformat, 1049381873),
    method_def(builtins_isinstance, 1092354326),
    constructor_def(builtins_UserWarning, 1106681050),
    constructor_def(builtins_ModuleNotFoundError, 1142003074),
    constructor_def(builtins_ConnectionRefusedError, 1171553869),
    constructor_def(builtins_BaseException, 1299431183),
    constructor_def(builtins_RuntimeWarning, 1323482143),
    constructor_def(builtins_Exception, 1326281044),
    constructor_def(builtins_UnboundLocalError, 1346345301),
    method_def(builtins___setitem__, 1364865276),
    constructor_def(builtins_FileNotFoundError, 1382762428),
    constructor_def(builtins_PermissionError, 1420080312),
    constructor_def(builtins_SystemError, 1431286868),
    method_def(builtins___getitem__, 1535436016),
    constructor_def(builtins_RangeObj, 1538428845),
    constructor_def(builtins_UnicodeEncodeError, 1538545476),
    constructor_def(builtins_NotImplementedError, 1581723060),
    constructor_def(builtins_ConnectionResetError, 1651090626),
    constructor_def(builtins_SyntaxWarning, 1678827394),
    constructor_def(builtins_InterruptedError, 1696514373),
    constructor_def(builtins_DeprecationWarning, 1745747977),
    constructor_def(builtins_UnicodeTranslateError, 1777242020),
    constructor_def(builtins_IndentationError, 1802197452),
    constructor_def(builtins_ConnectionError, 1818108799),
    constructor_def(builtins_ImportError, 1836878090),
    constructor_def(builtins_FutureWarning, 1879536502),
    method_def(builtins_getattr, 1886477984),
    constructor_def(builtins_ReferenceError, 1905798430),
    constructor_def(builtins_ProcessLookupError, 1911736232),
    constructor_def(builtins_TypeError, 1950608113),
    constructor_def(builtins_SyntaxError, 1956727606),
    constructor_def(builtins_OverflowError, 1985385347),
    constructor_def(builtins_GeneratorExit, 2000609318),
    constructor_def(builtins_NotADirectoryError, 2011759286),
    constructor_def(builtins_TimeoutError, 2075962582),
    method_def(builtins_bool, 2090120081),
    method_def(builtins_dict, 2090185033),
    method_def(builtins_eval, 2090235053),
    method_def(builtins_exec, 2090237354),
    method_def(builtins_exit, 2090237503),
    method_def(builtins_help, 2090324718),
    method_def(builtins_iter, 2090376761),
    method_def(builtins_list, 2090473057),
    method_def(builtins_open, 2090588023),
    method_def(builtins_type, 2090777863),
    constructor_def(builtins_ValueError, 2134842892),
    constructor_def(builtins_BytesWarning, 2135134114),
    method_def(builtins_gcdump, 2136649093),
};
class_inhert(builtins, TinyObj);

PikaObj *New_builtins(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, builtins);
    return self;
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_ArithmeticError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_ArithmeticError, builtins_Exception);

PikaObj *New_builtins_ArithmeticError(Args *args){
    PikaObj *self = New_builtins_Exception(args);
    obj_setClass(self, builtins_ArithmeticError);
    return self;
}

Arg *builtins_ArithmeticError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_ArithmeticError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_AssertionError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_AssertionError, builtins_Exception);

PikaObj *New_builtins_AssertionError(Args *args){
    PikaObj *self = New_builtins_Exception(args);
    obj_setClass(self, builtins_AssertionError);
    return self;
}

Arg *builtins_AssertionError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_AssertionError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_AttributeError){
    __BEFORE_MOETHOD_DEF
};
