HelloDuoLA/esp32_ble/components/PikaPython/pikascript-api/__pikaBinding.c
class_inhert(builtins_AttributeError, builtins_Exception);

PikaObj *New_builtins_AttributeError(Args *args){
    PikaObj *self = New_builtins_Exception(args);
    obj_setClass(self, builtins_AttributeError);
    return self;
}

Arg *builtins_AttributeError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_AttributeError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_BaseException){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_BaseException, TinyObj);

PikaObj *New_builtins_BaseException(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, builtins_BaseException);
    return self;
}

Arg *builtins_BaseException(PikaObj *self){
    return obj_newObjInPackage(New_builtins_BaseException);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_BlockingIOError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_BlockingIOError, builtins_OSError);

PikaObj *New_builtins_BlockingIOError(Args *args){
    PikaObj *self = New_builtins_OSError(args);
    obj_setClass(self, builtins_BlockingIOError);
    return self;
}

Arg *builtins_BlockingIOError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_BlockingIOError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_BrokenPipeError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_BrokenPipeError, builtins_ConnectionError);

PikaObj *New_builtins_BrokenPipeError(Args *args){
    PikaObj *self = New_builtins_ConnectionError(args);
    obj_setClass(self, builtins_BrokenPipeError);
    return self;
}

Arg *builtins_BrokenPipeError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_BrokenPipeError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_BufferError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_BufferError, builtins_Exception);

PikaObj *New_builtins_BufferError(Args *args){
    PikaObj *self = New_builtins_Exception(args);
    obj_setClass(self, builtins_BufferError);
    return self;
}

Arg *builtins_BufferError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_BufferError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_BytesWarning){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_BytesWarning, builtins_Warning);

PikaObj *New_builtins_BytesWarning(Args *args){
    PikaObj *self = New_builtins_Warning(args);
    obj_setClass(self, builtins_BytesWarning);
    return self;
}

Arg *builtins_BytesWarning(PikaObj *self){
    return obj_newObjInPackage(New_builtins_BytesWarning);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_ChildProcessError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_ChildProcessError, builtins_OSError);

PikaObj *New_builtins_ChildProcessError(Args *args){
    PikaObj *self = New_builtins_OSError(args);
    obj_setClass(self, builtins_ChildProcessError);
    return self;
}

Arg *builtins_ChildProcessError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_ChildProcessError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_ConnectionAbortedError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_ConnectionAbortedError, builtins_ConnectionError);

PikaObj *New_builtins_ConnectionAbortedError(Args *args){
    PikaObj *self = New_builtins_ConnectionError(args);
    obj_setClass(self, builtins_ConnectionAbortedError);
    return self;
}

Arg *builtins_ConnectionAbortedError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_ConnectionAbortedError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_ConnectionError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_ConnectionError, builtins_OSError);

PikaObj *New_builtins_ConnectionError(Args *args){
    PikaObj *self = New_builtins_OSError(args);
    obj_setClass(self, builtins_ConnectionError);
    return self;
}

Arg *builtins_ConnectionError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_ConnectionError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_ConnectionRefusedError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_ConnectionRefusedError, builtins_ConnectionError);

PikaObj *New_builtins_ConnectionRefusedError(Args *args){
    PikaObj *self = New_builtins_ConnectionError(args);
    obj_setClass(self, builtins_ConnectionRefusedError);
    return self;
}

Arg *builtins_ConnectionRefusedError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_ConnectionRefusedError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_ConnectionResetError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_ConnectionResetError, builtins_ConnectionError);

PikaObj *New_builtins_ConnectionResetError(Args *args){
    PikaObj *self = New_builtins_ConnectionError(args);
    obj_setClass(self, builtins_ConnectionResetError);
    return self;
}

Arg *builtins_ConnectionResetError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_ConnectionResetError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_DeprecationWarning){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_DeprecationWarning, builtins_Warning);

PikaObj *New_builtins_DeprecationWarning(Args *args){
    PikaObj *self = New_builtins_Warning(args);
    obj_setClass(self, builtins_DeprecationWarning);
    return self;
}

Arg *builtins_DeprecationWarning(PikaObj *self){
    return obj_newObjInPackage(New_builtins_DeprecationWarning);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_EOFError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_EOFError, builtins_Exception);

PikaObj *New_builtins_EOFError(Args *args){
    PikaObj *self = New_builtins_Exception(args);
    obj_setClass(self, builtins_EOFError);
    return self;
}

Arg *builtins_EOFError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_EOFError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_Exception){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_Exception, builtins_BaseException);

PikaObj *New_builtins_Exception(Args *args){
    PikaObj *self = New_builtins_BaseException(args);
    obj_setClass(self, builtins_Exception);
    return self;
}

Arg *builtins_Exception(PikaObj *self){
    return obj_newObjInPackage(New_builtins_Exception);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_FileExistsError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_FileExistsError, builtins_OSError);

PikaObj *New_builtins_FileExistsError(Args *args){
    PikaObj *self = New_builtins_OSError(args);
    obj_setClass(self, builtins_FileExistsError);
    return self;
}

Arg *builtins_FileExistsError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_FileExistsError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_FileNotFoundError){
    __BEFORE_MOETHOD_DEF
};
