HelloDuoLA/esp32_ble/components/PikaPython/pikascript-api/__pikaBinding.c
class_inhert(builtins_FileNotFoundError, builtins_OSError);

PikaObj *New_builtins_FileNotFoundError(Args *args){
    PikaObj *self = New_builtins_OSError(args);
    obj_setClass(self, builtins_FileNotFoundError);
    return self;
}

Arg *builtins_FileNotFoundError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_FileNotFoundError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_FloatingPointError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_FloatingPointError, builtins_ArithmeticError);

PikaObj *New_builtins_FloatingPointError(Args *args){
    PikaObj *self = New_builtins_ArithmeticError(args);
    obj_setClass(self, builtins_FloatingPointError);
    return self;
}

Arg *builtins_FloatingPointError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_FloatingPointError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_FutureWarning){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_FutureWarning, builtins_Warning);

PikaObj *New_builtins_FutureWarning(Args *args){
    PikaObj *self = New_builtins_Warning(args);
    obj_setClass(self, builtins_FutureWarning);
    return self;
}

Arg *builtins_FutureWarning(PikaObj *self){
    return obj_newObjInPackage(New_builtins_FutureWarning);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_GeneratorExit){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_GeneratorExit, builtins_BaseException);

PikaObj *New_builtins_GeneratorExit(Args *args){
    PikaObj *self = New_builtins_BaseException(args);
    obj_setClass(self, builtins_GeneratorExit);
    return self;
}

Arg *builtins_GeneratorExit(PikaObj *self){
    return obj_newObjInPackage(New_builtins_GeneratorExit);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_ImportError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_ImportError, builtins_Exception);

PikaObj *New_builtins_ImportError(Args *args){
    PikaObj *self = New_builtins_Exception(args);
    obj_setClass(self, builtins_ImportError);
    return self;
}

Arg *builtins_ImportError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_ImportError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_ImportWarning){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_ImportWarning, builtins_Warning);

PikaObj *New_builtins_ImportWarning(Args *args){
    PikaObj *self = New_builtins_Warning(args);
    obj_setClass(self, builtins_ImportWarning);
    return self;
}

Arg *builtins_ImportWarning(PikaObj *self){
    return obj_newObjInPackage(New_builtins_ImportWarning);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_IndentationError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_IndentationError, builtins_SyntaxError);

PikaObj *New_builtins_IndentationError(Args *args){
    PikaObj *self = New_builtins_SyntaxError(args);
    obj_setClass(self, builtins_IndentationError);
    return self;
}

Arg *builtins_IndentationError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_IndentationError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_IndexError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_IndexError, builtins_LookupError);

PikaObj *New_builtins_IndexError(Args *args){
    PikaObj *self = New_builtins_LookupError(args);
    obj_setClass(self, builtins_IndexError);
    return self;
}

Arg *builtins_IndexError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_IndexError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_InterruptedError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_InterruptedError, builtins_OSError);

PikaObj *New_builtins_InterruptedError(Args *args){
    PikaObj *self = New_builtins_OSError(args);
    obj_setClass(self, builtins_InterruptedError);
    return self;
}

Arg *builtins_InterruptedError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_InterruptedError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_IsADirectoryError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_IsADirectoryError, builtins_OSError);

PikaObj *New_builtins_IsADirectoryError(Args *args){
    PikaObj *self = New_builtins_OSError(args);
    obj_setClass(self, builtins_IsADirectoryError);
    return self;
}

Arg *builtins_IsADirectoryError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_IsADirectoryError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_KeyError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_KeyError, builtins_LookupError);

PikaObj *New_builtins_KeyError(Args *args){
    PikaObj *self = New_builtins_LookupError(args);
    obj_setClass(self, builtins_KeyError);
    return self;
}

Arg *builtins_KeyError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_KeyError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_KeyboardInterrupt){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_KeyboardInterrupt, builtins_BaseException);

PikaObj *New_builtins_KeyboardInterrupt(Args *args){
    PikaObj *self = New_builtins_BaseException(args);
    obj_setClass(self, builtins_KeyboardInterrupt);
    return self;
}

Arg *builtins_KeyboardInterrupt(PikaObj *self){
    return obj_newObjInPackage(New_builtins_KeyboardInterrupt);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_LookupError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_LookupError, builtins_Exception);

PikaObj *New_builtins_LookupError(Args *args){
    PikaObj *self = New_builtins_Exception(args);
    obj_setClass(self, builtins_LookupError);
    return self;
}

Arg *builtins_LookupError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_LookupError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_MemoryError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_MemoryError, builtins_Exception);

PikaObj *New_builtins_MemoryError(Args *args){
    PikaObj *self = New_builtins_Exception(args);
    obj_setClass(self, builtins_MemoryError);
    return self;
}

Arg *builtins_MemoryError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_MemoryError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_ModuleNotFoundError){
    __BEFORE_MOETHOD_DEF
};
