HelloDuoLA/esp32_ble/components/PikaPython/pikascript-api/__pikaBinding.c
class_inhert(builtins_ModuleNotFoundError, builtins_ImportError);

PikaObj *New_builtins_ModuleNotFoundError(Args *args){
    PikaObj *self = New_builtins_ImportError(args);
    obj_setClass(self, builtins_ModuleNotFoundError);
    return self;
}

Arg *builtins_ModuleNotFoundError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_ModuleNotFoundError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_NameError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_NameError, builtins_Exception);

PikaObj *New_builtins_NameError(Args *args){
    PikaObj *self = New_builtins_Exception(args);
    obj_setClass(self, builtins_NameError);
    return self;
}

Arg *builtins_NameError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_NameError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_NotADirectoryError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_NotADirectoryError, builtins_OSError);

PikaObj *New_builtins_NotADirectoryError(Args *args){
    PikaObj *self = New_builtins_OSError(args);
    obj_setClass(self, builtins_NotADirectoryError);
    return self;
}

Arg *builtins_NotADirectoryError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_NotADirectoryError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_NotImplementedError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_NotImplementedError, builtins_RuntimeError);

PikaObj *New_builtins_NotImplementedError(Args *args){
    PikaObj *self = New_builtins_RuntimeError(args);
    obj_setClass(self, builtins_NotImplementedError);
    return self;
}

Arg *builtins_NotImplementedError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_NotImplementedError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_OSError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_OSError, builtins_Exception);

PikaObj *New_builtins_OSError(Args *args){
    PikaObj *self = New_builtins_Exception(args);
    obj_setClass(self, builtins_OSError);
    return self;
}

Arg *builtins_OSError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_OSError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_OverflowError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_OverflowError, builtins_ArithmeticError);

PikaObj *New_builtins_OverflowError(Args *args){
    PikaObj *self = New_builtins_ArithmeticError(args);
    obj_setClass(self, builtins_OverflowError);
    return self;
}

Arg *builtins_OverflowError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_OverflowError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_PendingDeprecationWarning){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_PendingDeprecationWarning, builtins_Warning);

PikaObj *New_builtins_PendingDeprecationWarning(Args *args){
    PikaObj *self = New_builtins_Warning(args);
    obj_setClass(self, builtins_PendingDeprecationWarning);
    return self;
}

Arg *builtins_PendingDeprecationWarning(PikaObj *self){
    return obj_newObjInPackage(New_builtins_PendingDeprecationWarning);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_PermissionError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_PermissionError, builtins_OSError);

PikaObj *New_builtins_PermissionError(Args *args){
    PikaObj *self = New_builtins_OSError(args);
    obj_setClass(self, builtins_PermissionError);
    return self;
}

Arg *builtins_PermissionError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_PermissionError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_ProcessLookupError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_ProcessLookupError, builtins_OSError);

PikaObj *New_builtins_ProcessLookupError(Args *args){
    PikaObj *self = New_builtins_OSError(args);
    obj_setClass(self, builtins_ProcessLookupError);
    return self;
}

Arg *builtins_ProcessLookupError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_ProcessLookupError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
void builtins_RangeObj___next__Method(PikaObj *self, Args *args){
    Arg* res = builtins_RangeObj___next__(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_RangeObj___next__,
    "__next__", ""
);

class_def(builtins_RangeObj){
    __BEFORE_MOETHOD_DEF
    method_def(builtins_RangeObj___next__, 1090305216),
};
class_inhert(builtins_RangeObj, TinyObj);

PikaObj *New_builtins_RangeObj(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, builtins_RangeObj);
    return self;
}

Arg *builtins_RangeObj(PikaObj *self){
    return obj_newObjInPackage(New_builtins_RangeObj);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_RecursionError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_RecursionError, builtins_RuntimeError);

PikaObj *New_builtins_RecursionError(Args *args){
    PikaObj *self = New_builtins_RuntimeError(args);
    obj_setClass(self, builtins_RecursionError);
    return self;
}

Arg *builtins_RecursionError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_RecursionError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_ReferenceError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_ReferenceError, builtins_Exception);

PikaObj *New_builtins_ReferenceError(Args *args){
    PikaObj *self = New_builtins_Exception(args);
    obj_setClass(self, builtins_ReferenceError);
    return self;
}

Arg *builtins_ReferenceError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_ReferenceError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_ResourceWarning){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_ResourceWarning, builtins_Warning);

PikaObj *New_builtins_ResourceWarning(Args *args){
    PikaObj *self = New_builtins_Warning(args);
    obj_setClass(self, builtins_ResourceWarning);
    return self;
}

Arg *builtins_ResourceWarning(PikaObj *self){
    return obj_newObjInPackage(New_builtins_ResourceWarning);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_RuntimeError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_RuntimeError, builtins_Exception);

PikaObj *New_builtins_RuntimeError(Args *args){
    PikaObj *self = New_builtins_Exception(args);
    obj_setClass(self, builtins_RuntimeError);
    return self;
}

Arg *builtins_RuntimeError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_RuntimeError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_RuntimeWarning){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_RuntimeWarning, builtins_Warning);

PikaObj *New_builtins_RuntimeWarning(Args *args){
    PikaObj *self = New_builtins_Warning(args);
    obj_setClass(self, builtins_RuntimeWarning);
    return self;
}

