HelloDuoLA/esp32_ble/components/PikaPython/pikascript-api/__pikaBinding.c
Arg *builtins_RuntimeWarning(PikaObj *self){
    return obj_newObjInPackage(New_builtins_RuntimeWarning);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_StopAsyncIteration){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_StopAsyncIteration, builtins_Exception);

PikaObj *New_builtins_StopAsyncIteration(Args *args){
    PikaObj *self = New_builtins_Exception(args);
    obj_setClass(self, builtins_StopAsyncIteration);
    return self;
}

Arg *builtins_StopAsyncIteration(PikaObj *self){
    return obj_newObjInPackage(New_builtins_StopAsyncIteration);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_StopIteration){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_StopIteration, builtins_Exception);

PikaObj *New_builtins_StopIteration(Args *args){
    PikaObj *self = New_builtins_Exception(args);
    obj_setClass(self, builtins_StopIteration);
    return self;
}

Arg *builtins_StopIteration(PikaObj *self){
    return obj_newObjInPackage(New_builtins_StopIteration);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
void builtins_StringObj___next__Method(PikaObj *self, Args *args){
    Arg* res = builtins_StringObj___next__(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_StringObj___next__,
    "__next__", ""
);

class_def(builtins_StringObj){
    __BEFORE_MOETHOD_DEF
    method_def(builtins_StringObj___next__, 1090305216),
};
class_inhert(builtins_StringObj, TinyObj);

PikaObj *New_builtins_StringObj(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, builtins_StringObj);
    return self;
}

Arg *builtins_StringObj(PikaObj *self){
    return obj_newObjInPackage(New_builtins_StringObj);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_SyntaxError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_SyntaxError, builtins_Exception);

PikaObj *New_builtins_SyntaxError(Args *args){
    PikaObj *self = New_builtins_Exception(args);
    obj_setClass(self, builtins_SyntaxError);
    return self;
}

Arg *builtins_SyntaxError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_SyntaxError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_SyntaxWarning){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_SyntaxWarning, builtins_Warning);

PikaObj *New_builtins_SyntaxWarning(Args *args){
    PikaObj *self = New_builtins_Warning(args);
    obj_setClass(self, builtins_SyntaxWarning);
    return self;
}

Arg *builtins_SyntaxWarning(PikaObj *self){
    return obj_newObjInPackage(New_builtins_SyntaxWarning);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_SystemError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_SystemError, builtins_Exception);

PikaObj *New_builtins_SystemError(Args *args){
    PikaObj *self = New_builtins_Exception(args);
    obj_setClass(self, builtins_SystemError);
    return self;
}

Arg *builtins_SystemError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_SystemError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_SystemExit){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_SystemExit, builtins_BaseException);

PikaObj *New_builtins_SystemExit(Args *args){
    PikaObj *self = New_builtins_BaseException(args);
    obj_setClass(self, builtins_SystemExit);
    return self;
}

Arg *builtins_SystemExit(PikaObj *self){
    return obj_newObjInPackage(New_builtins_SystemExit);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_TabError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_TabError, builtins_IndentationError);

PikaObj *New_builtins_TabError(Args *args){
    PikaObj *self = New_builtins_IndentationError(args);
    obj_setClass(self, builtins_TabError);
    return self;
}

Arg *builtins_TabError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_TabError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_TimeoutError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_TimeoutError, builtins_OSError);

PikaObj *New_builtins_TimeoutError(Args *args){
    PikaObj *self = New_builtins_OSError(args);
    obj_setClass(self, builtins_TimeoutError);
    return self;
}

Arg *builtins_TimeoutError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_TimeoutError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_TypeError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_TypeError, builtins_Exception);

PikaObj *New_builtins_TypeError(Args *args){
    PikaObj *self = New_builtins_Exception(args);
    obj_setClass(self, builtins_TypeError);
    return self;
}

Arg *builtins_TypeError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_TypeError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_UnboundLocalError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_UnboundLocalError, builtins_NameError);

PikaObj *New_builtins_UnboundLocalError(Args *args){
    PikaObj *self = New_builtins_NameError(args);
    obj_setClass(self, builtins_UnboundLocalError);
    return self;
}

Arg *builtins_UnboundLocalError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_UnboundLocalError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_UnicodeDecodeError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_UnicodeDecodeError, builtins_UnicodeError);

PikaObj *New_builtins_UnicodeDecodeError(Args *args){
    PikaObj *self = New_builtins_UnicodeError(args);
    obj_setClass(self, builtins_UnicodeDecodeError);
    return self;
}

Arg *builtins_UnicodeDecodeError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_UnicodeDecodeError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_UnicodeEncodeError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_UnicodeEncodeError, builtins_UnicodeError);

PikaObj *New_builtins_UnicodeEncodeError(Args *args){
    PikaObj *self = New_builtins_UnicodeError(args);
    obj_setClass(self, builtins_UnicodeEncodeError);
    return self;
}

Arg *builtins_UnicodeEncodeError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_UnicodeEncodeError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_UnicodeError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_UnicodeError, builtins_ValueError);

