HelloDuoLA/esp32_ble/components/PikaPython/pikascript-api/__pikaBinding.c
PikaObj *New_builtins_UnicodeError(Args *args){
    PikaObj *self = New_builtins_ValueError(args);
    obj_setClass(self, builtins_UnicodeError);
    return self;
}

Arg *builtins_UnicodeError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_UnicodeError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_UnicodeTranslateError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_UnicodeTranslateError, builtins_UnicodeError);

PikaObj *New_builtins_UnicodeTranslateError(Args *args){
    PikaObj *self = New_builtins_UnicodeError(args);
    obj_setClass(self, builtins_UnicodeTranslateError);
    return self;
}

Arg *builtins_UnicodeTranslateError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_UnicodeTranslateError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_UnicodeWarning){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_UnicodeWarning, builtins_Warning);

PikaObj *New_builtins_UnicodeWarning(Args *args){
    PikaObj *self = New_builtins_Warning(args);
    obj_setClass(self, builtins_UnicodeWarning);
    return self;
}

Arg *builtins_UnicodeWarning(PikaObj *self){
    return obj_newObjInPackage(New_builtins_UnicodeWarning);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_UserWarning){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_UserWarning, builtins_Warning);

PikaObj *New_builtins_UserWarning(Args *args){
    PikaObj *self = New_builtins_Warning(args);
    obj_setClass(self, builtins_UserWarning);
    return self;
}

Arg *builtins_UserWarning(PikaObj *self){
    return obj_newObjInPackage(New_builtins_UserWarning);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_ValueError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_ValueError, builtins_Exception);

PikaObj *New_builtins_ValueError(Args *args){
    PikaObj *self = New_builtins_Exception(args);
    obj_setClass(self, builtins_ValueError);
    return self;
}

Arg *builtins_ValueError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_ValueError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_Warning){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_Warning, builtins_Exception);

PikaObj *New_builtins_Warning(Args *args){
    PikaObj *self = New_builtins_Exception(args);
    obj_setClass(self, builtins_Warning);
    return self;
}

Arg *builtins_Warning(PikaObj *self){
    return obj_newObjInPackage(New_builtins_Warning);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_ZeroDivisionError){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_ZeroDivisionError, builtins_ArithmeticError);

PikaObj *New_builtins_ZeroDivisionError(Args *args){
    PikaObj *self = New_builtins_ArithmeticError(args);
    obj_setClass(self, builtins_ZeroDivisionError);
    return self;
}

Arg *builtins_ZeroDivisionError(PikaObj *self){
    return obj_newObjInPackage(New_builtins_ZeroDivisionError);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
void builtins_bytearray___getitem__Method(PikaObj *self, Args *args){
    int __key = args_getInt(args, "__key");
    int res = builtins_bytearray___getitem__(self, __key);
    method_returnInt(args, res);
}
method_typedef(
    builtins_bytearray___getitem__,
    "__getitem__", "__key"
);

void builtins_bytearray___init__Method(PikaObj *self, Args *args){
    Arg* bytes = args_getArg(args, "bytes");
    builtins_bytearray___init__(self, bytes);
}
method_typedef(
    builtins_bytearray___init__,
    "__init__", "bytes"
);

void builtins_bytearray___iter__Method(PikaObj *self, Args *args){
    Arg* res = builtins_bytearray___iter__(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_bytearray___iter__,
    "__iter__", ""
);

void builtins_bytearray___len__Method(PikaObj *self, Args *args){
    int res = builtins_bytearray___len__(self);
    method_returnInt(args, res);
}
method_typedef(
    builtins_bytearray___len__,
    "__len__", ""
);

void builtins_bytearray___next__Method(PikaObj *self, Args *args){
    Arg* res = builtins_bytearray___next__(self);
    method_returnArg(args, res);
}
method_typedef(
    builtins_bytearray___next__,
    "__next__", ""
);

void builtins_bytearray___setitem__Method(PikaObj *self, Args *args){
    int __key = args_getInt(args, "__key");
    int __val = args_getInt(args, "__val");
    builtins_bytearray___setitem__(self, __key, __val);
}
method_typedef(
    builtins_bytearray___setitem__,
    "__setitem__", "__key,__val"
);

void builtins_bytearray___str__Method(PikaObj *self, Args *args){
    char* res = builtins_bytearray___str__(self);
    method_returnStr(args, res);
}
method_typedef(
    builtins_bytearray___str__,
    "__str__", ""
);

void builtins_bytearray_decodeMethod(PikaObj *self, Args *args){
    char* res = builtins_bytearray_decode(self);
    method_returnStr(args, res);
}
method_typedef(
    builtins_bytearray_decode,
    "decode", ""
);

class_def(builtins_bytearray){
    __BEFORE_MOETHOD_DEF
    method_def(builtins_bytearray___init__, 904762485),
    method_def(builtins_bytearray___iter__, 911732085),
    method_def(builtins_bytearray___next__, 1090305216),
    method_def(builtins_bytearray___setitem__, 1364865276),
    method_def(builtins_bytearray___getitem__, 1535436016),
    method_def(builtins_bytearray_decode, 2021571977),
    method_def(builtins_bytearray___len__, 2047989248),
    method_def(builtins_bytearray___str__, 2056834106),
};
class_inhert(builtins_bytearray, TinyObj);

PikaObj *New_builtins_bytearray(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, builtins_bytearray);
    return self;
}

Arg *builtins_bytearray(PikaObj *self){
    return obj_newObjInPackage(New_builtins_bytearray);
}
#endif

#ifndef PIKA_MODULE_BUILTINS_DISABLE
class_def(builtins_object){
    __BEFORE_MOETHOD_DEF
};
class_inhert(builtins_object, TinyObj);

PikaObj *New_builtins_object(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, builtins_object);
    return self;
}

Arg *builtins_object(PikaObj *self){
    return obj_newObjInPackage(New_builtins_object);
}
#endif

#ifndef PIKA_MODULE_MYTEST_DISABLE
void mytest_MYTEST_testMethod(PikaObj *self, Args *args){
    mytest_MYTEST_test(self);
}
method_typedef(
    mytest_MYTEST_test,
    "test", ""
);

class_def(mytest_MYTEST){
    __BEFORE_MOETHOD_DEF
    method_def(mytest_MYTEST_test, 2090756197),
};
class_inhert(mytest_MYTEST, TinyObj);

PikaObj *New_mytest_MYTEST(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, mytest_MYTEST);
    return self;
}

Arg *mytest_MYTEST(PikaObj *self){
    return obj_newObjInPackage(New_mytest_MYTEST);
}
#endif

